[
  {
    "title": "MEGATHREAD sobre el Medio Oriente.",
    "comments": [
      {
        "comment": "Saludos, estimado /u/Migol-16, y usuarios de r/OpinionesPolemicas.\n\nGracias por aportar nuevos e interesante y/o funables temas a nuestra comunidad, recuerda respetar las reglas para así tener un mejor espacio para que todos sean incluidos. ¿Quieres saber los últimos cambios más importantes del subreddit? [Entra aquí](https://www.reddit.com/r/OpinionesPolemicas/comments/1itpl7v/cambios_importantes_llegan_a_ropinionespolemicas/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button).\n\nReiteramos que recuerden leer las reglas antes de interactuar y reportar a aquellos que identifiquen que rompan las mismas. ¡Gracias por formar parte de esta comunidad!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OpinionesPolemicas) if you have any questions or concerns.*",
        "id": "myiz8y0",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Poco se habla que los países árabes principales (Egipto, Emiratos, Arabia) le tienen más tirria a Irán que a Israel",
        "id": "myj0pef",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "que consideramos discurso de odio? porque si cualquier cosa que diga sobre israel va a ser tachado de antisemita pues estamos jodidos",
        "id": "myj0nts",
        "score": 4,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Que muchos anglofilos critican al mundo árabe de atrasado cuando los responsables son los gobiernos autoritarios y teocraricos sostenidos gracias a que detrás hay una potencia respaldandolos, por ejemplo Arabia Saudita, que recién en 2018 permitió a las mujeres conducir, sin embargo EEUU les viene comprando petróleo desde mucho antes de eso.",
        "id": "myj22pv",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Los megathread, son la forma que tienen los mod de evitar post de cierto tipo.",
        "id": "myjahqd",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "[deleted]",
        "id": "myjd1h8",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No hay duda de que Irán está tratando de obtener armas nucleares, pueden estar a favor o en contra de los ataques de Israel, pero es un hecho innegable que los están haciendo, no le tienen que creer a Netanyahu, sólo basta con ver los reportes de la [International Atomic Energy Agency](https://www.iaea.org/sites/default/files/25/06/gov2025-24.pdf) y el [Institute for Science and International Security](https://isis-online.org/isis-reports/detail/analysis-of-iaea-iran-verification-and-monitoring-report-may-2025/).",
        "id": "mykebx6",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Tengo hambre.",
        "id": "myizu01",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Están matando al sub y al planeta al no permitir voces disidentes que publiquen cosas que no os gusta, si no soportan las opiniones polemicas cambiaros el nombre a opiniones aceptables.",
        "id": "myja99d",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El medio oriente se peleará entre sí (consideró Israel medio oriente y los judíos básicamente árabes) manipulados y coludidos con fuerzas externas, hasta el final de los tiempos. Nada más que decir. Son religiosos extremistas \n\nJamás terminará el conflicto hasta que los nuken o algún lado ultimadamente gane",
        "id": "myjeagj",
        "score": 0,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "cómo que no puede haber deseos de genocidio????? no dejan hacer nada divertido 🙄",
        "id": "myj6whk",
        "score": -1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Los árabes no se caen bien entre sí. Por eso casi todos siguen en ese estado tan empobrecido. Y por eso son tan manipulables por otras facciones externas",
        "id": "myjg23j",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Egipto recibe dinero de EUA, creo que es obvio el porque.",
        "id": "myj1w3g",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "https://www.britannica.com/topic/hate-speech",
        "id": "myjh8wh",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Todos sabemos que un discurso de odio siempre está a la interpretación del escucha. Puedo decir “me gustan las manzanas” y alguien dirá que es discurso de odio. Da igual tus intenciones, o lo que realmente estás intentando decir. Así que solo acepta que te pueden eliminar un comentario solo porque si",
        "id": "myjei6a",
        "score": 0,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "O sea, no desear un holocausto o un genocidio de x o y religión o etnia. Con eso.",
        "id": "myj0vu2",
        "score": -1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Oye apenas agarré la onda. Porque le echas la culpa a estados unidos de que Arabia Saudita apenas en el 2018 dejara a las mujeres conducir jaajajaj que Estados Unidos tiene de las bolas a los políticos árabes para que no dejen a las mujeres conducir?",
        "id": "myjgji1",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El mundo árabe ya estaba atrasado y estancado cientos de años antes de que Estados Unidos siquiera existiera. En el 1400s cuando Europa entraba en el renacimiento, medio oriente hacía a la imprenta ilegal por considerarla hereje\n\nDe hecho, el primer contacto que tuvo Estados Unidos en los 1800s con medio oriente fue cuando piratas musulmanes secuestraban barcos americanos, en una reunión en Londres preguntaron a un enviado porque les hacían eso a lo que contestó que “eran infideles y por lo tanto tenían derecho a robarles y matarles”\n\nQue no fue por la intervención rusa y británica, la única razón por la que derrocaron al gobernante de iran y la gente empezó a tener derechos humanos? Que luego acabó con la revolución islamica….\n\nClaro que todo mundo ahora se aprovecha de ellos. Están sumamente retrocedidos y son muy fáciles de manipular al antojo de cualquiera",
        "id": "myjerir",
        "score": 0,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Jaja sí soy",
        "id": "myjh3z9",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Es más que nada para que no haya 100 publicaciones de lo mismo, lo mismo se hizo el 8M.",
        "id": "myji0py",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Ambos tienen derecho a existir mi buen, y pues tienen que aprender a compartir ese pedazo de municipio si o si. \n\nY pon tu que no quieran compartir la tierra esa, como realmente se nota. En ese caso es de lamentar que el conflicto sea muy desigual, daría mucho gusto que fuera un pleito entre fuerzas iguales. Que el mejor de ellos ganara.",
        "id": "myji2og",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Hola, tu comentario ha sido eliminado porque el tema principal es la situación geopolítica en Medio Oriente, o sea, Israel, Irán, Estados Unidos y los demás actores involucrados en el conflicto. Disculpa las molestias.",
        "id": "myj0enx",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "decir por ejemplo que israel no deberia existir se consideraria discurso de odio?",
        "id": "myj5dx9",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No le hecho directamente labculpa a EEUU de eso\n\nLo puse de ejemplo porque en gran parte el hecho de que un gobierno que tuviera ese tipo de prohibiciones pueda haberse sostenido tanto tiempo es porque hay alguien que no tiene problema en hacer negocios con esa clase de regímenes, y si le añadimos que Arabia Saudi tiene petróleo, significa para el gobierno Saudi muchísimo dinero; Estados Unidos le compra petróleo a Arabia Saudita y es así como este gobierno puede seguir perdurando en el tiempo y mantener su arcaica monarquía en el trono.\n\n\nAdemás que aquellos gobiernos que a pesar de su autoritarismo fueron relativamente liberales al final fueron boicoteados por revelarse contra la hegemonía occidental, llámese Irak, Libia o más recientemente Siria.\n\nY las potencias como China o Rusia en este juego están para competir contra Estados Unidos.\n\nA lo que voy: No tienen problema con mantener radicales religiosos al poder poder mientras sean funcionales a sus intereses",
        "id": "myjkrkq",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El imperio más poderoso de la época renacentista en Europa era el otomano, un imperio musulmán. De hecho, es la razón de la cual por qué los europeos decidieron dar la vuelta al mundo para llegar a India. Es más, hasta el siglo 13 más o menos Europa estaba atrasada frente al mundo musulmán, hasta la caída de Bagdad en 1258 qué marcó el fin de la época dorada musulmana, y bueno, ahí si Europa lo superó por bastante.",
        "id": "myjgo3m",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Los que prohibieron la imprenta fueron los otomanos, quienes además de los árabes también tenían otros pueblos bajo su yugo.\n\nAdemás Medio Oriente es una región con varios pueblos ademas de los árabes.",
        "id": "myjgf1e",
        "score": 0,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Hay cosas que se pueden ceder pero eso no",
        "id": "myk0fal",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "En mis estándares, no, pero decir algo como \"hagan un segundo holocausto\" o algo así, sí.",
        "id": "myj5iu7",
        "score": 0,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si.",
        "id": "myjbml1",
        "score": 0,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Hasta que esto mismo los dejó en la mierda y jamás volvieron a salir. Jamás obtuvieron algo similar a una biblia 2.0, peleas internas infinitas, bloqueo intelectual y científico. Zero progreso social. solamente se metieron el pie a sí mismos",
        "id": "myjgx3w",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No también fueron los árabes lol, pero como dices es una región muy grande. Pero todos comparten valores similares que los han dejado….donde están",
        "id": "myjgs71",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "ok capitan israel, puedes volver a masacrar bebes",
        "id": "myjby0v",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Sentí que tu comentario era algo ninguneante hacia los musulmanes. Supongo que si entiendes el contexto histórico tienen más sentido las cosas. En resumen, no es por ser musulmanes que se atrasaron, es por las hegemonías imperiales qué mucha aveces estancan el conocimiento y el progreso. Además de las múltiples invasiones mongolas pero bueno.",
        "id": "myjhk0r",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Diría que es más una combinación de factores que atribuirle todo a un solo factor, ya sea que por la religión, la cultura, o el imperialismo.\n\nPues si analizamos cada uno de estos puntos individuales también han habido países que afrontaron alguno de esos problemas y eso no les impidió salir adelante.",
        "id": "myjhscd",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No hago eso, tú promueves las ideas que provocan que paso eso.",
        "id": "myjdxwh",
        "score": -1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "mis ideas son que robarle la tierra a un grupo de persona que lleva mas de 2000 viviendo en ella esta mal, me da igual lo que ponga en tu version mala del señor de los anillos",
        "id": "myjeb5l",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Espero que seas español y no un latino con herencia española hablando un idioma europeo en tierra robada.\n\nLos judíos se originaron en Judea.",
        "id": "myjep17",
        "score": 0,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Soy español\n\nLa mayor parte de los latinos tienen sangre indigena\n\nMe da igual, los judíos llevan sin vivir en esa zona más de 2000 años, lleva más tiempo siendo palestina que Judea",
        "id": "myjf4gn",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": ">La mayor parte de los latinos tienen sangre indigena\n\nLa mayor parte de los israelíes tienen sangre cananea.\n\n>Me da igual, los judíos llevan sin vivir en esa zona más de 2000 años, lleva más tiempo siendo palestina que Judea\n\npor eso les decimos a los disque \"antisionistas\" antisemitas, porqué lo son, estás negando dos mil años de historia judía y aplicando un estándar diferente a Israel que a otros países, incluso antes del sionismo en Jerusalem los judíos ya eran el grupo étnico más grande, no sabes de lo que hablas.\n\nIsrael lleva existiendo 80 años, la mayoría nacieron ahí, hablan un idioma que se originó ahí, tienen una conexión milenaria histórica y cultural con esa tierra, no se van a ir a ningún lado y no tienen porqué hacerlo, mientras antes lo entiendan mejor y más fácil se resuelve el conflicto.",
        "id": "myjfwfb",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      }
    ]
  },
  {
    "title": "Hoy es Día de Preguntarle a tu Mod Local. Hagan sus preguntas, mis estimados.",
    "comments": [
      {
        "comment": "Saludos, estimado /u/Migol-16, y usuarios de r/OpinionesPolemicas.\n\nGracias por aportar nuevos e interesante y/o funables temas a nuestra comunidad, recuerda respetar las reglas para así tener un mejor espacio para que todos sean incluidos. ¿Quieres saber los últimos cambios más importantes del subreddit? [Entra aquí](https://www.reddit.com/r/OpinionesPolemicas/comments/1itpl7v/cambios_importantes_llegan_a_ropinionespolemicas/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button).\n\nReiteramos que recuerden leer las reglas antes de interactuar y reportar a aquellos que identifiquen que rompan las mismas. ¡Gracias por formar parte de esta comunidad!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OpinionesPolemicas) if you have any questions or concerns.*",
        "id": "mvfbbk3",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Creo que hacen un gran trabajo no limitando los posts a basicamente nada. Los mods de los subs de reddit se creen dioses por tener algo de poder siendo jovenes o niños y ponen reglas para todo, ustedes no. Felicidades.",
        "id": "mvmsh3z",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "¿Esta publicación es para distraer a la población mexicana para que no voten y así gane Morena más fácilmente?",
        "id": "mvg74vd",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Mucha gente se queja de temas repetitivos, ustedes que tienen las estadísticas, cual es el tema mas recurrente en el sub?",
        "id": "mvfis8t",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "¿Pueden poner la opcion de \"solo respuestas serias\"?, creo que este sub lo necesita urgentemente.",
        "id": "mvgh693",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "u/JebusdeMazaret El Mezías 🛐\n\nTu eres el mismo Jebus al que le reza Homero Simpson?\n\nSÁLVAME JEBUSSS!\n\n![gif](giphy|xU9TT471DTGJq)",
        "id": "mxmsnfv",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "1 la mayoría de esos moderadores podrían estar en la cárcel \n\n2 aquí huele a cebolla 🧅🥺",
        "id": "mvh3u78",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "u/Migol-16 cuando sacan al mod nuevo que aplica mal las reglas y borra los mensajes que no le gustan? es pésimo en su trabajo no remunerado",
        "id": "mw983sm",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "u/migol-16, ¿por qué eres tan perfecto?",
        "id": "mxmoyil",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Gracias, mon señor, hacemos lo posible lidiando con Reddit.",
        "id": "mvmuc0t",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Siempre hemos sido una cortina de humo, de hecho, estoy en tus paredes.",
        "id": "mvgfzsw",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Cómo dijo el compañero, no hay estadísticas concretas, pero casi siempre son los mismos y vienen en rachas de popularidad.\n\nPor ejemplo, este mes estoy casi seguro que habrá un aumento en los temas LGBT.",
        "id": "mvgej9f",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "En las estadísticas no aparecen las temáticas de las publicaciones. A menos que saquemos los porcentajes por nuestra cuenta, no se sabe a ciencia cierta. \nPero te puedo contestar desde mi percepción: en los últimos días, lo que más he visto son dos temáticas: El conflicto de Israel con Palestina y sobre migrantes venezolanos; el último tiene un pocos días que hizo boom, pero antes de ello, diría que era Izquierda vs Derecha.\n\n\nAmigable recordatorio de que pueden reportar las publicaciones por ser repetitivas. Pero tengo criterio para hacerlo, recuerden que es válido tocar la misma temática siempre y cuando sea desde un enfoque diferente a otros posts que se hayan hecho.",
        "id": "mvg5xwn",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Considero que, en su mayoría, responden con seriedad, la seriedad necesaria cuando es un post bien argumento.",
        "id": "mvghwoc",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Esperemos que el camarada u/JebusdeMazaret haga acto de presencia.",
        "id": "mxmxwlv",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Recién me entero de la existencia del post XD\n\nRespondiendo a tu pregunta, sí.\n\n![gif](giphy|a3zqvrH40Cdhu)",
        "id": "mxoe4zs",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El que lo huele lo tiene.",
        "id": "mvh48ph",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "![gif](giphy|bSnKZDXjACteU)",
        "id": "mxoegdy",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Estoy viendo con mis compañeros, es complicado abordar el tema, gracias.",
        "id": "mw98nnc",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Así me creó Diosito, qué te digo.",
        "id": "mxmpbq9",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si me contestó ☺️☺️☺️",
        "id": "mxoynre",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Y tuve el yo honor y placer de que me respondieras\n\n![gif](giphy|xTiTnMhJTwNHChdTZS)",
        "id": "mxoeakk",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Por qué? Les fue implantado por los admin de reddit para mantener el sub en control?\n\nSi es así, es hora de ir cambiando de comunidad 👍🏼",
        "id": "mw99056",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Nice",
        "id": "mxpf47s",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "![gif](giphy|n5hiRIMKXzkHH9x1lm)",
        "id": "mxoosr3",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Pidió unirse y su historial se veía bien, normal.",
        "id": "mw99sc6",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Bueno, es mal mod porque aplica mal las reglas cuando un mensaje no le gusta / toca su ideología, es hora de darle las gracias y hasta pronto.\n\nLos mods tienen que mantener la neutralidad y claramente este usuario no lo está haciendo",
        "id": "mw9acyn",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      }
    ]
  },
  {
    "title": "Si no lees literatura, ensayos, filosofía, historia etc. y tu formación de creencias vienen de escuchar podcast, tus opiniones más que polémicas probablemente son tontas.",
    "comments": [
      {
        "comment": "Saludos, estimado /u/MrAvocado1988, y usuarios de r/OpinionesPolemicas.\n\nGracias por aportar nuevos e interesante y/o funables temas a nuestra comunidad, recuerda respetar las reglas para así tener un mejor espacio para que todos sean incluidos. ¿Quieres saber los últimos cambios más importantes del subreddit? [Entra aquí](https://www.reddit.com/r/OpinionesPolemicas/comments/1itpl7v/cambios_importantes_llegan_a_ropinionespolemicas/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) ¿Te interesa lo que pasa en medio oriente? [Entra aquí](https://www.reddit.com/r/OpinionesPolemicas/comments/1letslf/megathread_sobre_el_medio_oriente/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button).\n\nReiteramos que recuerden leer las reglas antes de interactuar y reportar a aquellos que identifiquen que rompan las mismas. ¡Gracias por formar parte de esta comunidad!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OpinionesPolemicas) if you have any questions or concerns.*",
        "id": "mykfvx8",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Suena como algo que diría alguien que leyo El Alquimista y Habitos atomicos... Para hacer alarde intelectual y sentirse mejor.",
        "id": "myki8fa",
        "score": 4,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Es que para empezar antes de dar una opinión tienes que tener el marco teórico adecuado al tema. De opinar cualquiera opina cualquier cosa y me da gracia porque hasta porcentajes le ponen cuando claramente no han checado ninguna estadística.\nSi vas a emitir un juicio primero apegate a la evidencia! \nSaludos ",
        "id": "mykh0dy",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Imaginate la cantidad de personas que leen literatura, ensayos, filosofia, historia, etc, cuya formación de creencias no viene de escuchar podcast, que no contestan tu post porque lo vieron como una opinión como, más que polemica, probablemente tonta. 😂",
        "id": "mykv2ag",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Puedes encontrar muchos podcasts donde hablan expertos y personas con un alto nivel educativo\n\nCual es la diferencia entonces entre leer la opinion de un experto y escucharla?\n\nPor que una manera de absorber su conocimiento es valido y el otro no?\n\nMe suena a mero elitismo de tu parte",
        "id": "mykh0yl",
        "score": 5,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Puedes leer libros y usar los podcast como un complemento, todo suma.\nCualquier persona que tiene ganas de aprender utiliza todos los recursos que tiene a la mano para retroalimentarse, contrastar información y formarse un criterio.\n\nPero si algo he visto es que hay gente con una mayor destreza mental que otra, y eso facilita más el  aprendizaje y la retención de información.\nY por otra parte hay personas que devoran libros por mera pretención intelectual pero no entienden ni la mitad de lo que leyeron.",
        "id": "mykhxzy",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Sería polémico si hubieras afirmado lo contrario",
        "id": "mykis7d",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Pues depende. Personas que crecieron dentro de familias muy religiosas y desde niños son orientados a leer sus libros \"sagrados\", a leer sólo publicaciones y libros orientados a defender su postura ideológica, obligados a asistir a reuniones con personas que piensan igual que ellos, obligados a ir a retiros, etc., no es que sean tontas, sólo ven en el mundo desde su perspectiva.\n\nSi por otro lado consumes salseo en redes, podcast sobre temas frívolos y vacíos, filosofía con orientaciones woke y feminismo sin sentido, música bailable pero con letras totalmente carentes de inteligencia, y además vas por el mundo queriendo corregir lo que escapa de tu comprensión, levantando la voz para hacer valer tu punto de vista miserable y desechable, y aunque te muestren la verdad, defiendes tu ignorancia autoimpuesta; tampoco eres tonto, sólo eres el más pendejo de toda la especie humana",
        "id": "myklzoj",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Creo que esto puede expresarse de manera un poco más rigurosa pero en el fondo concuerdo con ella.",
        "id": "mykmxbm",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Creo que las opiniones están permitidas, solo como opiniones, es decir no deberían ser valoradas con ningún grado de verdad. Sin importar la formación del opinante. Por supuesto que si es fundamentada con un debido marco teórico, esa opinión, es validada. Ahora para formar un marco teórico válido para opinar sugiero leer mucho, no solo a aquellos que formulen hipótesis, a priori, alineadas con mí creencia a priori de la debida investigación. \n\nPor ejemplo, si estoy de acuerdo con el peronismo y solo leo peronistas no estás formando una opinión válida, solo válidas tus creencias, o si sos libertario y solo lees libertarios no estas formando una opinión válida, solo válidas tus creencias.\n\nEs importante leer interdisciplinariamente diversos autores y corrientes ideológicas/teóricas.",
        "id": "mykmygl",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "O de un meme \"interesante\" de facebook, reforzado por algún podcast.",
        "id": "mykvqql",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Me gusta leer y lo suelo hacer peeero no creo que el hecho de leer sea una base sólida para fundamentar una creencia. No lo digo por vos porque ignoro si este es tu argumento, pero me he encontrado gente que cree cualquier cosa que dice un libro y personalmente creo que una persona que no lea por placer pero que sepa investigar, evaluar fuentes y comparar datos yendo a la fuente de información va a tener opiniones muchísimo mejor respaldadas que alguien que solo lee y toma a los libros como una fuente válida. Hay gente que cita libros de política o historia como quien cita a un invitado de algún podcast solo porque se presenta como experto, leen tanto que terminan sin saber nada. Hay podcasts que son como clases, que te enseñan de un tema desde la fuente pero obviamente tanto el podcast como el libro solo te muestran lo que el autor quiera mostrarte.\nObviamente estoy hablando de las lecturas más intelectuales o académicas y no tanto de novelas. Bah, no sé, eso es lo que creo, creo que estoy parcialmente de acuerdo, hay tantos libros y tantos podcasts que siento que depende que sea lo que consumas.\n\nEdición: Ah soy boluda perdón, solo me dejaba ver el título de tu post y ahora puedo ver lo que escribiste entero y es similar a lo que digo ajajja así que creo que no vamos a pensar muy distinto",
        "id": "mykw5fb",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Las opiniones más pendejas vienen de gente que por haberse leído dos libros se creen cultos e iluminados.",
        "id": "mykov5i",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Muchas de mis opiniones empiezan por mi volante de pago y las necesidades de mi hogar, lo siento, pero no soy tan 'Intelectual' ni tengo pensamientos 'Profundos'... Aunque si tengo una que otra opinión polémica.",
        "id": "mykqn2j",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Los libros no son la única fuente de información. Reddit es una buena fuente, youtube es una buena fuente, whatsapp lo mismo.\n\nYo diría que es una mala fuente el contenido tiktok, reels o youtube shorts. Bueno en realidad todo instagram, pero en youtube solo los shorts, los videos largos aportan mucho a veces.",
        "id": "mykqvnz",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Y si escuchas podcasts de gente que lee literatura, ensayos, filosofia, historia, etc?",
        "id": "mykux4z",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Las opiniones más tontas que he escuchado provienen de gente que solamente leen información de ensayos y filósofia. Es bastante irónico, y muy penoso. Porque no deberían tener excusa para saber tan poco. Son básicamente como esos mismos escuchas de podcast que solo creen lo primero que leen. No tienen criterio, su criterio es remplazado por estas mentes superiores de sus lecturas y respiran a base de falacias de autoridad \n\nSi leen un libro de filosofía donde se discute la existencia de dios, no creen en dios, si 2 meses después leen un ensayo de algun intelectual de la edad media. Se vuelven devotos cristianos\n\nTambién son propensos a ser dogmáticos. Todo comunista de papel que dice que eres un burgués jodido que se quiere sentir rico porque te tomas un café de starbucks cada 2 semanas. Se la pasa leyendo ensayos y filosofía e historia.",
        "id": "myl3dru",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "no lean. leer es gay.",
        "id": "myl3t3j",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "La verdad es que depende de la literatura y Podcasts que escuches. No es lo mismo leer a Dostoyevski que a Coelho.  Como tampoco es lo mismo escuchar el podcast de Making Sense de Sam Harris, o a Ian Bremmer su quieres oir sobre política internacional que oir La Corneta.",
        "id": "myl7ej6",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No es sobre leer. Pero vaya si la profundidad de tu razonamiento se limita a unos reels entonces si, probablemente pienses que eres más listo de lo que eres",
        "id": "mylkj4b",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Te lo escribo mejor: Si tu opinión viene de lo que lees o escuchas, y no de pensar por ti mismo, tus opinones no son realmente tuyas.",
        "id": "myltjrl",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Sobretodo libros clasicos como el quijote, que parece el malviaje de un drogadicto.",
        "id": "mylu2cq",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Yo creo que andas confundido.\n\nHay muchos podcasts pendejos y por eso piensas que todos son así.\n\nEs como si alguien pasara todo el día leyendo mierda. No lo haría precisamente más inteligente.",
        "id": "mym07zb",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "esencialmente estas diciendo que alguien analfabeto no puede tener opinión, dale una vuelta anda",
        "id": "mym26ev",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "-Mi compa el menos clasista",
        "id": "mykgs8y",
        "score": -4,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No si hablamos del podcast de Jordi wild",
        "id": "mykghk3",
        "score": -3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Con Paulo Cohelo no te metas /s",
        "id": "mykkbd3",
        "score": 0,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "De hecho en ningún momento opino que ver podcast no te aporte nada, lo que digo es que si tus opiniones solo vienen de lo que absorbes ahí probablemente no sea una buena opinión.",
        "id": "mykjzub",
        "score": -4,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Concuerdo con lo que dices y no digo que hay que callarse las opiniones, al contrario hay que expresarlas pero también ser conciente de que tus opiniones pueden ser pobres en argumentos. Hay que tener humildad de recibir las críticas y si te interesa un tema tratar de leer e investigar más en diversas fuentes.",
        "id": "mykqbu5",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Leer no te salva de dar opiniones pendejas pero si te puede ayudar a dar opiniones menos pendejas.",
        "id": "mykqp6c",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Escúchalos de algo servirá. ",
        "id": "myl4uck",
        "score": 0,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "¿Leer es clasista?",
        "id": "mykihai",
        "score": 14,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "En especial si hablamos de Jordi Wild",
        "id": "mykgyte",
        "score": 6,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Pensé que este comentario era sarcasmo.",
        "id": "mykim7k",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "En eso pensé justo \n\n(Veo todos)",
        "id": "mykgz2g",
        "score": -2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Mala explicación señor OP, leer también es absorber, entiendo que lo que quieres decir ahora es que tienes que reflexionar la información que lees/escuchas y no solo aceptarla y ya, pero eso no es lo que decias en tu post pillín.",
        "id": "mylvt11",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Leer no es clasista, pendejear a los que no lo hacen PUEDE ser clasista.\n\nPuede que no lo parezca pero el acceso y fomento a la literatura (y en general a capital cultural) es algo difícil en los estratos socioeconómicos más bajos",
        "id": "myklcil",
        "score": 9,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Un señor que llega de una jornada de trabajo físico de 8 ó 10 horas lo que menos le provoca es leer y hasta hace pocas décadas, para leer necesitabas libros, porque la información no estaba tan disponible.\n\nAún hoy en día, necesitas un celular de ciertas características y acceso a internet, lo cual no todo el mundo puede permitirse. Quizás en cierto modo sí lo es.",
        "id": "mykr4co",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Parece que si, por que en mi país los niños pobres no saben leer.",
        "id": "mym3bxy",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Ha ido gente muy culta en diferentes ámbitos",
        "id": "mykhcm9",
        "score": -1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Concuerdo que puede haber personas o lugares con pobre que el acceso la literatura o a la educación y no es su culpa. \n\n\nPero mi comentario va para las personas que creen que tienen opiniones polémicas sin leer nunca algo en su vida. ",
        "id": "mykngtd",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No mames los libros son hiper baratos y en internet están todos gratis.\n\nSi tienes para pagar internet y consumir podcasts pedorros y videos de YouTube, tienes acceso a casi todos los libros de la humanidad.",
        "id": "myklypi",
        "score": 7,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Vengo de los estratos económicos más bajos (la calle, literal, comiendo de la basura) y si para los estratos económicos les da para el vicio, les da para un libro. No mamen con defender a la gente voluntariamente ignorante que pretende que su opinión toda pendeja y desinformada es igual de válida y tiene el mismo peso que la de alguien formado en el asunto de la discusión. Por eso terminan votando políticos todos pendejos.",
        "id": "myksiab",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Pero leer/conocimientos, que tiene que ver con clases sociales?\n\nHoy en día el conocimiento está a la palma de la mano, y quién elija no instruirse es por mera elección personal",
        "id": "mykvxzf",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Sabes cuanto cuesta un pdf en Internet?",
        "id": "mym3fk9",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Nah.\n\nLos libros ni son exclusivos.\n\nEl Manifiesto Comunista y los libros de Adam Smith cuestan menos que una hamburguesa de fonda en digital.\n\nSi no los lees, pues es porque eres bien tonto y perezoso.\n\nNo porque seas clase media, pobre, o rica.",
        "id": "myklw8w",
        "score": -1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "En efecto, pero siempre esta jordi metiendo su cuchara y su humor que particularmente me mata la atmosfera porque corta al invitado.\n\nYa ni que decir de las preguntas que hacia en anteriores entrevistas, parecia que el tio se metia 3 cubatas y preguntaba lo que le salia de la raja, por lo menos ahora he visto que está corrigiendo eso.",
        "id": "mykhtel",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Hey, una vez contesté una opinión polémica y mi respuesta era relacionada a la posición que tienes y me llovió bien gacho, creo que muchos de los que tienen un poco de tiempo y no lo invierten en leer o mejorar su percepción de la realidad se escudan en muchísimos pretextos. Vas a acabar precisamente de clasista aunque seas lector de PDF's o ePUB's piratas como yo.\n\nSobre tu comentario, no solamente debes aventurarte a formarte un criterio, sino también a cuestionarlo, de lo contrario te ves siendo soldado de un dogma o ideología,  entonces también es importante leer cosas que te desafíen, si eres un ateo que nunca ha leído la Biblia, solamente eres un adepto, no un pensador.\n\nPero si, hay personas que tienen relaciones digitales o vidas alternas en sus teléfonos, bien podrían leer unos minutos y enriquecer su criterio, aunque no hay que menospreciar otras formas de acceso al conocimiento, la televisión, los podcasts, las revistas y prácticamente todo si usas el método adecuado ayuda, siempre y cuando no te la comas con papas.",
        "id": "mykqpwq",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Jajajajajaja, hubieras puesto un mejor ejemplo que El Manifiesto Comunista",
        "id": "myknb7i",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "O quiza simplemente no me interese.",
        "id": "mylu5zm",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      }
    ]
  },
  {
    "title": "Los padres no deberían permitir el uso de un celular hasta los 15",
    "comments": [
      {
        "comment": "Saludos, estimado /u/och8888888, y usuarios de r/OpinionesPolemicas.\n\nGracias por aportar nuevos e interesante y/o funables temas a nuestra comunidad, recuerda respetar las reglas para así tener un mejor espacio para que todos sean incluidos. ¿Quieres saber los últimos cambios más importantes del subreddit? [Entra aquí](https://www.reddit.com/r/OpinionesPolemicas/comments/1itpl7v/cambios_importantes_llegan_a_ropinionespolemicas/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button).\n\nReiteramos que recuerden leer las reglas antes de interactuar y reportar a aquellos que identifiquen que rompan las mismas. ¡Gracias por formar parte de esta comunidad!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OpinionesPolemicas) if you have any questions or concerns.*",
        "id": "myio8dp",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Concuerdo, siguiente pregunta",
        "id": "myiopqg",
        "score": 5,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Lo de los lentes es lo de menos. Nomás con hablar sobre salud mental y como los contenidos en redes pueden dañarles",
        "id": "myipiu7",
        "score": 7,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Y si, tal cual.",
        "id": "myip9qk",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Concuerdo. Pero nadie hace caso.\n\nEs como he dicho. No es igual una Nintendo DS que un celular y lo más peligroso es que sea sin supervisar",
        "id": "myiquj2",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Avalo esta perspectiva bajo el criterio de que el cerebro de un niño no está diseñado para controlar la cantidad de estímulos ni el acceso tan inmediato a ellos que ofrece un celular.",
        "id": "myir18q",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Completamente de acuerdo...\nAunque es mejor normalizar telefonos simples que solo tengan llamadas, mensajes de texto, geolocalización y acciones de emergencia con auditoria de texto y voz.\n\nCuando ganen dinero y puedan mantener sus gustos que se compren lo que quieran o necesiten.",
        "id": "myis9hq",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Hasta los 10 diría yo, luego de eso empiezan a necesitarlo porque empiezan a moverse solos.\n\nTal vez podría ser dar un celular que solo pueda llamar y escribir whatsapps.",
        "id": "myiszcu",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Un celular es una gran herramienta de comunicación y control. Yo les proveeria uno, pero no smartphone. Y en caso de que deba ser smart, uno bloqueado con control parental",
        "id": "myitsvp",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Escuché unas declaraciones de una pedagoga y psicóloga infantil y dejaba bastante claro que un niño no debería tener smartphone  hasta los 14/15 años.\n\nEstoy cansado de ver a hijos muy pequeños de amigos y amigos que para evitar estar encima de ellos, les arrean el móvil y la tabet para que las horas pasen tranquilamente para lo padres. Es una salvajada. Luego van de medalla en el pecho \"padre madre del año\".\n\nYa teníamos una generación de taradetes pero estás que nos vienen que son todavía más joven dan terror.\n\nSerán los que nos trataran en el hospital cuando estemos en nuestros últimos años y tiene pinta que  va a ser una odisea.",
        "id": "myj6onn",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Estoy completamente de acuerdo.... Y si tengo hijos 6/4 años y nada de aparatos digitales en la casa....",
        "id": "myjqv8x",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "no celular, ni televisión, ni azúcar.",
        "id": "myiq72x",
        "score": 4,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "¿Y por qué a los 15, y no a los 14 o los 16?",
        "id": "myiq53t",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si y no, ambas a la vez",
        "id": "myippv6",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Es fácil juzgar cuando no se está en esa posición. Igual sería muy hipócrita decirle a tu hijo- no uses celular y ver a toda su familia cenando con el celular en la mano.",
        "id": "myir9mt",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "15 me parece demasiado cuando tranquilamente podes ir incorporándolos de forma mas o menos responsable en sus vida. Al fin y al cabo no deja de ser una herramienta que en buenas manos hace mas bien que mal.",
        "id": "myircjt",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Lentes? El peor problema es la dependencia que crea debido a sus estímulos constantes. Ya es malo para los adultos imagina en un cerebro en desarrollo. Pasa lo mismo con muchos dibujos animados actuales. Hay que tener cuidado con qué le ofreces a tu hijo porque como sea proclive a conductas adictivas estás jodido.",
        "id": "myisbza",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Estoy de acuerdo. Tuve mi primer celular a los 8 años, y fue lo peor que me pudo haber pasado. Vi cosas que no debía ver, hice cosas que no debía hacer. Lo digo, sobre todo, porque hay gente mala en este mundo, y hablo desde mi propia experiencia. Me hubiera encantado que, en lugar de darme un celular a esa edad, me hubieran involucrado en otro tipo de actividades recreativas.",
        "id": "myiwava",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "15 es poco yo creo q hasta los 16-17. Es mi opinión, pero también el entorno social influye osea que totalmente desconectado de la realidad de las redes sociales no va estar",
        "id": "myiwwe7",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "como todas las veces que se publica esto en este sub, la mayoria de la gente responde con cosas todas idiotas \"eske tu no tienez ijoz no zabez ke ez rekontra difizil\"",
        "id": "myiyca1",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No, yo no tuve teléfono hasta los 16 y eso genera enorme desventaja en el colegio, por ejemplo en clases de bases de datos era el único que tenía que copiar los códigos enteros en el cuaderno, lo que me tomaba toda la hora de clase, y tampoco podía darle mi número de teléfono a mis admiradoras de grados inferiores, lo que me hizo perder oportunidades con dos mujeres atractivas jóvenes que son únicas de la adolescencia, ya que en la adultez se vuelven hipérgamas y yo no voy a estar gastando dinero en mujeres. ",
        "id": "myj0zwe",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Pues digo esto porque OP da el ejemplo de niños de 2 y 3 años y menores de 15 \n\nYo tuve mi primer telefono a los 12 y también le daría uno a mis hijos a esa edad y claro qué revisaría el contenido, porque así fue conmigo\n\nPor eso viene mi confusión, si son niños pequeños, que tiene que se prohiban si igual están muy pequeños para esos mercados?",
        "id": "myj34lq",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Totalmente",
        "id": "myjaa6w",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si tuviera un hijo, sólo tendría un teléfono celular cuando tuviera dinero para comprarse uno.",
        "id": "myjc5fe",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Celular basico de llamadas de 12 a 15 y smartphome de 15 en adelante",
        "id": "myk8j6r",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Vi en internet una entrevista de un niño que empezó a ver pornografía a los 10, y a los 12 tuvo relaciones con una compañera suya de secundaria 3 años más grande. Lo peor es que dijo que todos los consejos de seducción los vió en internet y que ahí aprendió a hacer el amor xD.",
        "id": "mykraio",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Yo siento que a los 10-11 es mejor, pero sin redes sociales. Podrían necesitar un celular para llamar a alguien en caso de alguna emercengia, tener un celular no es lo mismo que estar crónicamente online",
        "id": "myl6yjh",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "En vez de prohibir por que no mejor lo controlas por tiempo y contenido?\n\n\nMe caga esa idea pendeja que tiene la mayoría que creen que con prohibir a diestra y siniestra se soluciona todo.\n\nEs la misma actitud huevona que OP critica pero al reves, asi como es de huevones aventarle el teléfono al niño para que se entretenga lo es prohibir todo nada mas por que no te nace el educar y controlar.",
        "id": "mylpky6",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Estoy de acuerdo, cuando tengas hijos aplícalo, yo trataré también, .",
        "id": "myisvxy",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Igual que cuando decian no les deje ver tanta tv a sus hijos",
        "id": "myitzgt",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Yo creo que el problema es que muchos padres piensan que solo existen smart phones. Ningun niño necesita un teléfono inteligente…. Con un celular normal estaría bien.",
        "id": "myiradn",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Tiene hijos?",
        "id": "myipz2s",
        "score": -7,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Yo te voy a decir por que es que genera polémica.\n\nPorque si no lo hiciste antes no esperes que acaten tus ordenes arrebatándoles el teléfono.\n\nCuando prohíbes algo no eliminas la demanda, creas un mercado negro para obtener lo que sea que hayas prohibido. Ya paso en Estados Unidos en la época de la prohibición. Las personas dejaron de beber? No! Se creo un mercado negro de venta de alcohol a precios inflados? Si!\n\nEn resumen prohibir algo nunca es la solución. \n\nPero no me creas... Velo por ti misma!",
        "id": "myipqfz",
        "score": -2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Estoy de acuerdo pero ponerlo a la práctica es mucho más difícil de lo que podría parecer. Si dejas sin celular a tu hijo cuando todos los demás niños si lo tienen solo le va a causar problemas sociales. Los niños a esa edad son crueles y si ven que alguien no tiene celular solo va a ser objeto de burlas etc. \n\nLo mejor es que tengan celular con control parental para que puedan usarlo para cosas muy específicas como para mensajear con sus amigos etc. Hoy en día con controles parentales puedes hasta configurarlo para que lo usen una aplicación cada ciertas horas del día, o controlar con que números pueden interactuar o agregar a su lista de contactos.\n\nSi bien lo mejor es que no lo utilicen hasta cierta edad, el dejar a tu hijo/a como el único que no lo tiene solo le vas a causar problemas a él o ella. El punto es que haya un cambio cultural donde a los niños **en general** no utilicen celulares hasta cierta edad, hasta entonces el control parental sería la mejor opción.",
        "id": "myjcupp",
        "score": 0,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Depende de cómo eres , o como tratas a tu hijo , poniendo límites. O un horario de a qué hora ver la tv .",
        "id": "myje5mt",
        "score": 0,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Cuestión de criterios",
        "id": "myk0jzy",
        "score": 0,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Es lindo decirlo, pero muy difícil de llevarlo a la práctica. Es el nuevo \"chupete\" electrónico. Y los cánones sociales y laborales no dejan mucho tiempo a los padres para que compartan con sus hijos, como sucedía en generaciones anteriores. Digo, de pronto, me parece...🍸",
        "id": "myistrm",
        "score": -2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Y ni hablar del efecto de las redes sociales o el ciberacoso.",
        "id": "myipw29",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "a los 10 yo estaba comprando sorpresitas en la primaria jajajaj",
        "id": "myit5si",
        "score": 0,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Totalmente de acuerdo, solo que no toda la televisión, solo tener supervisión cuando la vean.",
        "id": "myir5nm",
        "score": 0,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "creo que es la edad en la que varios adolescentes necesitan crear vínculos además de su familia, es claro que ya no es como antes y ahora la mayoría necesita de un celular para hacerlo de mejor manera, por eso creo que a los 15 sería la edad, saludos",
        "id": "myir8tx",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Te falto el tal vez! Y el quizá!",
        "id": "myircno",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Cual sería el problema? En general en las familias toman alcohol y le dicen que no es para niños. Por ahí 15 es un montón, pero hasta los 10/11/12 lo veo bien",
        "id": "myixtr5",
        "score": 4,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Puta, no comer con el teléfono en la mano, es terrible.",
        "id": "myjpouu",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "la television, por muy dañina que pudiera llegar a ser,estaba limitado a ciertos tiempos y su contenido mas regulado.\n\nel celular es algo que se lleva todo el tiempo, en la cama, en el auto, incluso al mismo que ve la tele, en los restaurantes, los parques, la escuela. a todo lugar, todo el tiempo\n\nademas de que la forma en la que enganchan los celulares se hace de formas mucho mas elaboradas, donde billones han sido gastados para hacer algoritmos cada vez mejores y mas rapidos para mantener a la gente el mayor tiempo posible pegada a este, como lo hace aplicaciones de tiktok. algo que la tele nunca imagino\n\ny el contenido es cada vez peor, paseate 10 minutos por youtube kids para que entiendas la clase de porqueria a la que los exponen. una explosion de sonidos y colores cuyo unoco proposito es mantener, la cada vez menor capacidad de retencion de los niños",
        "id": "myiyuyh",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "O sea, porque es más fácil para UD criar a un niño enchufándole un teléfono desde los 6 meses piensa que está bien hacerlo?",
        "id": "myix76v",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Muy buena, y se queja de LATAM, cuando pasa en todo el mundo jajaja.",
        "id": "myirxf8",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Y que tiene que ver eso?",
        "id": "myir4u3",
        "score": 0,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No me imagino a los pibes de 8 años yendo a un mercado negro de celulares.",
        "id": "myir1dr",
        "score": 7,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Disculpa la ignorancia, entiendo qué se quiera dar un ejemplo con prohibir \n\nPero cual es el punto? O sea es que leo que mencionas y das ejemplo de cómo se da un Mercado negro\n\nPero si se les prohibe desde temprana edad ¿Qué Mercado negro hay o equivalente? Simplemente no tienen telefono y si eventualmente crecen y ahorran y compran uno pues ese ya es otro tema de cómo manejar la situación",
        "id": "myiqkjj",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      }
    ]
  },
  {
    "title": "Si el comunismo fuera mejor, ya estaría funcionando en algún lado",
    "comments": [
      {
        "comment": "Saludos, estimado /u/Dangerous_Addendum_1, y usuarios de r/OpinionesPolemicas.\n\nGracias por aportar nuevos e interesante y/o funables temas a nuestra comunidad, recuerda respetar las reglas para así tener un mejor espacio para que todos sean incluidos. ¿Quieres saber los últimos cambios más importantes del subreddit? [Entra aquí](https://www.reddit.com/r/OpinionesPolemicas/comments/1itpl7v/cambios_importantes_llegan_a_ropinionespolemicas/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) ¿Te interesa lo que pasa en medio oriente? [Entra aquí](https://www.reddit.com/r/OpinionesPolemicas/comments/1letslf/megathread_sobre_el_medio_oriente/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button).\n\nReiteramos que recuerden leer las reglas antes de interactuar y reportar a aquellos que identifiquen que rompan las mismas. ¡Gracias por formar parte de esta comunidad!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OpinionesPolemicas) if you have any questions or concerns.*",
        "id": "mykcqdv",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si era tan miserable y que se destruiría a si mismo porque fueron necesarias decádas de intervenciones militares y politicas para tratar de destruir incluso sus minimas influencias (como en Latinoamérica)",
        "id": "myko2qu",
        "score": 14,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": ">el comunismo sigue en plan “todavía no se ha aplicado bien”. ¿En serio? ¿Ni una sola vez en todo ese tiempo? ¿En ningún país?\n\nPero es verdad que no se ha aplicado. Ni bien, ni mal; no ha habido ningún sistema comunista real en la historia contemporánea, quitando tal vez pequeñas excepciones en contextos de guerra. El problema del comunismo y gran parte de la crítica anarquista hacia él es que no es nada fácil llegar. El socialismo sí se ha aplicado.\n\nOtra observación que cabe destacar es que los movimientos liberales que dieron lugar al moderno estado-nación surgieron, cayeron, y volvieron a surgir varias veces hasta imponerse como sistema dominante en la política europea. No migrar hacia nuevos sistemas que hayan fracasado anteriormente nos habría dejado estancados en el Antiguo Régimen",
        "id": "mykh66t",
        "score": 5,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Apesta a bot este post",
        "id": "myko103",
        "score": 5,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Sos como Homero cuando dice \"y si era tan bueno por que se murio?\" La gente de derecha nunca entiende nada de nada.\nLe tienen fobia a los libros?",
        "id": "mykkv35",
        "score": 11,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "La verdad es que todo parte de la crítica que hizo Marx al capitalismo, al mismo tiempo que lo elogia. Que pasó? Que todos lo reinterpretaron a su antojo gracias a que el tipo dejó abiertas varias ideas, de ahí que exista el leninismo, Stalinismo, maoismo, guevarismo etc etc etc. Asi que la teoría de Marx es sólo una crítica que puede servir de herramienta pero como dejo abierto a criterio del lector esas herramientas también quedo abierta la posibilidad de hacer un sistema totalitario con esas herramientas como en la URSS y la mayoría de países disque Comunistas/socialistas en donde, por ejemplo, se aferran a la \"dictadura del proletariado\" que el hermoso Marx no dijo cuanto tiempo tendría que durar así que lo dejo a discreción de cada \"pueblo\" que se convirtió en la discreción de cada dictador XD. Y bueno ya se sabe como termina el cuento: dictaduras que parecen monarquias y en el exterior gente diciendo \"es que eso no es socialismo verdadero\" pero tampoco es que los critiquen muchoXD.",
        "id": "mylath8",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si leyeras tantito de materialismo dialéctico entenderías que no hay comunismo antes del socialismo.\n\nNo hay un país que haya intentado el comunismo, porque primero hay que lograr el socialismo.\n\nLa historia sigue su paso, no vas a poner comunismo de un día a otro, no existen las soluciones a medio plazo (por eso la democracia es una mamada, no logras cambios permanentes con mandatos de 4-6 años).\n\nTiene relativamente poco tiempo que se habla de comunismo. ¿Sabes por cuánto tiempo ha existido el capitalismo? Por lo menos 600 años. Incluso hoy puedes ver ejemplos de atrocidades del capitalismo, te podría nombrar muchos más de los que podrías nombrar sobre el \"comunismo\".\n\nSolamente busca las hambrunas (sí, plural) que Inglaterra provocó en la India con tal de sacar provecho. \"Eso es imperialismo\", va, entonces Inglaterra no es capitalista (nótese el sarcasmo).",
        "id": "mylcx96",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "China",
        "id": "mykdsdf",
        "score": 10,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Uno de los 3 países comunistas qué hay es Vietnam y pues su economía e índices de desarrollo nunca los tendremos en latinoamericana",
        "id": "mykrb0n",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No \"han tenido el mismo tiempo en la cancha\" de hecho la creación del concepto de comunismo es una respuesta al capitalismo lo que que implica que el capitalismo ya existía antes\n\nY creo que una de las razones por las que no se ha podido aplicar es porque uno de sus objetivos es la abolición del estado lo que también implica abolir el ejercito lo que dejaría vulnerable a esa sociedad a tantos detractores, amenazas externas y enemigos que tiene y tendría",
        "id": "myku0fj",
        "score": 4,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Todo lo que funciona y beneficia a la mayoría ahuevo prevalece y crece. No es el caso del comunismo, porque nada bueno surge de dar todo el poder al tipo de ser humano más inútil del planeta, el burócrata",
        "id": "mykofys",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si hubieras leido Marx o Trotsky o a algun autor Marxista en lugar de tomas tus ideas de videos de youtube, entenderias que para poder formar una sociedad comunista, se necesita que se aplique en todo el mundo a la vez, no puede haber comunismo en un solo país\nY si hubieras leído Ecopol en algún punto de tu vida sabrías que el capitalismo tiene más de 150 años lmao",
        "id": "mykr0d6",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Amén",
        "id": "mykjqcx",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Dulce de leche a 3 dolares tampoco es funcional con loa sueldos de Angola en Argentina. No se, parece que el mercado solo no se regula.",
        "id": "mykl5h8",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Jajaja si.",
        "id": "mylddmh",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Es el sistema de control social más efectivo.",
        "id": "myldnie",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si es tan malo ¿Por qué se esfuerzan en sabotearlo? Solito caería",
        "id": "myleqgq",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": ">\"Y no es como si la humanidad estuviera controlada por millonarios.\"\n\n??",
        "id": "mylewxm",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Literalmente Homero Simpson",
        "id": "mylfgdx",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Y crees que el capitalismo esta funcionando? O que alguna vez lo ha hecho?",
        "id": "mylgj3c",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El capitalismo no funciona.",
        "id": "mylh9ld",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si el comunismo fuera tan imposible como pensáis, EEUU no se hubiera gastado millones financiando y desastibilisabdo cada intentl de que funcione.",
        "id": "mylhnzz",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "China\n\n![gif](giphy|ZwOBYaxQR67XJOOb9J|downsized)",
        "id": "mylhwrg",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Ya deberían cambiar el nombre del subreddit a \"Opiniones normies\".",
        "id": "mylhzqv",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El comunismo clásico de ha quedado desfasado y tiene que ser renovado para que pueda usarse en el mundo moderno. El mundo ya no es como a principios del siglo xx.",
        "id": "myli43r",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Siempre que el capital lo permita.\nNunca olvidar que el enemigo de el comunismo y de cualquier política igualitaria siempre va a ser el rico que quiere más.\nY los soldados de los ricos que quieren más son los que aspiran a ser como ellos.\n\nTambién os recuerdo que los ricos son los únicos que siguen manteniendo esa cosa antigua que se llama conciencia de clase.\nA los pobres mediante propaganda nos han hecho pelearnos entre nosotros para que los dejemos tranquilos.",
        "id": "myli66v",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "otro pndjo que confunde el autoritarismo con el comunismo/capitalismo.\n\nBukele en el Salvador es autoritarismo igual que en Cuba o Venezuela o China.  no se porqué son tan tontillos que no entienden de dinámicas internacionales y política.",
        "id": "myli7s3",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Nada impide a la gente agruparse, comprar empresas y repartir con los trabajadores.",
        "id": "mylk4m1",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Hay una opción intermedia y que funciona bien, el socialismo",
        "id": "myll3ws",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Tampoco funciona el capitalismo, son chorradas que solo existen para dividir a la gente y que muchos terminen comentando lo mismo que vos aca. Últimamente en este sub solo escriben pavadas.",
        "id": "myllfam",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Quien habla hoy en dia del pinche comunismo? No funciona pues y ya",
        "id": "mylm3hq",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "O no. El capitalismo funcionó porque enriquecia las clases altas.\n\nEl comunismo no lo hace, las rebaja y redistribuye. Quien tiene el poder tanto militar como mediático son la clase alta, a la que no le conviene el comunismo. No así como sí les convenía un sistema capitalista en lugar del feudalista anterior.",
        "id": "mylmian",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Ya sabes lo que te dirán, no era comunismo y tal",
        "id": "myln2fo",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "La humanidad está literalmente controlada por millonarios xd\n\nA casi todos los países donde se ha implementado el socialismo (el socialismo de verdad, no el PSOE) o el comunismo se les ha sometido a bloqueos (Cuba) o injerencias externas, golpes de estado y desestabilización por parte de países capitalistas (URSS, Afganistán, Irán).",
        "id": "mylnqq8",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Es que ya funciona en todo el mundo, vivimos en una amalgama.\n\nTenemos servicios de salud financiado por los trabajadores. \n\nTenemos escuelas y univerdades públicas.\n\nEn la mayoría de los países se mantiene la separación de la iglesia y del estado.\n\nTenemos sindicatos y derecho a las utilidades.\n\nLos servicios de necesidad básica también los controla el estado. \n\nTambién se controlan los recursos energéticos por medio del estado.",
        "id": "mylogs8",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El comunismo funciona en ciertas comunidades pequeñas:  lapones, ciertas tribus amazónicas, no sé si en el áfrica profunda....",
        "id": "myloksu",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El capitalismo no tiene 150 años, no seas pendejo. Si bien no hay una fecha de inauguración,  el capitalismo surge entre el siglo XVI y XVIII y desde ese entonces países capitalistas han tenido éxito y otros han fallado. Así que desde ahí empiezas mal porque varios siglos de ventaja para consolidarse te va a dar mucho poder\n\nEl comunismo en 1 siglo ha hecho surgir a 2 imperios. Uno de ellos falló (URSS) y el otro aprendió de sus errores y ya ha superado a EE.UU en muchos sectores (RPC)",
        "id": "mylprtw",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Literalmente las mejores economías del mundo son mixtas con gran control del estado y políticas socialistas.\n\nY te recuerdo que el comunismo transformo un estado feudal en una superpotencia industrial y científica en muy poco tiempo, tanto para Rusia como para China.\n\nLa URSS fracaso por la propia idiosincracia Rusa y la burocratización del sistema. La Yugoslavia de Tito era un país mucho mejor que cualquiera de países actuales que se separaron.\n\n¿Que crees que fue el New Deal de EEUU?\n\nThomas Sankara hizo grandes logros para desarrollar su país y sacarlos de la pobreza ¿Qué paso? Los de siempre compraron a su segundo al mando para que los traicionara y lo matara. Hoy Burkina Faso es muy pobre.",
        "id": "mylq2i1",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Espérate a enterarte que el comunismo no lo invento Marx. La idea básica del comunismo se ha intentado muchas veces a lo largo de la historia. El ejemplo más antiguo que conozco son los hermanos Graco en Roma, que trataron de colectivizar el campo y ponerlo en manos de los agricultores",
        "id": "mylqw3d",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Es el sistema político que más muertes ha causado en el mundo, es inútil seguir hablando de esto.",
        "id": "mylr9u5",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si el comunismo fuese un fracaso que colapsa por sí solo, no haría falta que Estados Unidos lo combatiera activamente.\n\nPero desde la Guerra Fría hasta hoy, ha habido una larga lista de intervenciones, golpes de Estado y bloqueos económicos impulsados por EE.UU. contra países con gobiernos comunistas o socialistas. ¿Por qué tanta presión si ese modelo fuera tan débil o inviable?\n\nJustamente porque representaba (y en algunos casos, aún representa) una amenaza para sus intereses económicos y su influencia global.\n\nEl hecho de que un sistema sea combatido con tanta fuerza no prueba que sea malo, sino que puede ser incómodo para quienes ostentan el poder.",
        "id": "mylrwgg",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El comunismo tiene los enemigos mas poderosos del planeta. Nunca va a funcionar. Sin que exista una ronda masiva de defenestraciones..\n\nEl mundo occidental funciona y se autodestruye para que los 4 de siempre acumulen mas y mas…\n\nNo sé si será mejor o no, pero realmente lo parece si haces un poco de “zoom out”",
        "id": "mylrwun",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Lo mejor sería tirar a todos los políticos en una olla de aceite hirviendo y darle de comer a África. \n\n\nDicho eso, no siempre funciona lo mejor. Funciona lo que no logran desestabilizar. África, LATAM, el comunismo (tengo mis dudas de que esa mierda sirva de algo), y ahora la Unión Europea no están funcionando porque no solo se roban todo desde adentro, sino que existen agentes externos que invierten en desestabilizar la región. \n\n\nQué banderita con rojo, azul y blanco será la cumpable? (Si pensaste en un país en particular, te recuerdo que hay varios que tienen esos colores y siempre están en medio del quilombo). ",
        "id": "myls6mt",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El mundo tiene recursos suficientes como para que el comunismo funcione, sin embargo también tiene la cantidad exacta de personas tan enfermas de poder como para que eso sea imposible. \n\n\nEl comunismo nunca va a funcionar. No en este planeta. Una colonia de exploradores en Marte no tiene otra alternativa que el comunismo para sobrevivir. Para pensar. ",
        "id": "mylseiz",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Busque Social Democracia, se considera de izquierda y ha funcionado en muchos paises. La izquierda tiene muchos matices no sólo existe el comunismo.",
        "id": "mylv1px",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Te van a decir q China es comunista, que la URSS fue un éxito y que los países nórdicos son Comunistas",
        "id": "mylxy4m",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Después de haber leído varias de tus opiniones y justificaciones de tu modo de pensar, te pregunto:\n\nSi el socialismo es tan malo, tan ineficiente y tan destinado al fracaso, Estados Unidos tiene que bloquear castigar, manipular y manipular toda la información al respecto. Cuba y Venezuela bloqueados, aunque si fueran libres estarían destinados al fracaso, entonces para que bloquearlos...\n\nAhora, por qué la guerra comercial con China? Será que China le ganó la guerra a EU connais propias reglas?\n\nPor qué China esta ganando tanto poder en África? Será que todo este tiempo EU y Europa solo explotaron y no ayudaron nada a África y China en menos de 5 años ya hizo más por ellos de lo que hicieron tus ídolos imperialistas?",
        "id": "mylyq5g",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Que te parece china",
        "id": "mylzwnr",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "los sistemas actuales no son comunistas, son una mejora y una mezcla de los que si funcionan, Rusia y china por ejemplo",
        "id": "mym2a21",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El problema es que no sabemos cómo sería una sociedad comunista porque la teoría dice el comunismo es cuando el proletario se hace con los medios de producción,lo que llevará a un estado sin capital como meta \"evolutiva\". \n\nLa cosa es que todas las revoluciones han sido saboteadas por un grupo que se convirtieron en el nuevo poder autoritario, simplemente quitaron a la monarquia y se pusieron burgueses, etc. (La revolución fue política pero no realmente social). Al final en paises como la URSS, China, Vietnam, etc. los propios \"comunistas\" mataron a los anarquistas y demás gente que  se habia agrupado según las teorias socialistas. La nueva élite se hace con el poder y acaba con todo intento de verdadera revolución social. \n\nEl comunismo lenista/stalinista dice que primero es necesario el Estado para acumular capital y que en algun momento darán el paso hacia la sociedad perfecta sin capital, pero llevamos años esperando y esperando...y solo veo a los millonarios chinos enriquecerse, dudo que estén dispuestos a esa \"evolución\" xd. \n\n\n\nAl final comunismo y capitalismo son las dos caras de una misma moneda, en una tenemos empresas privadas haciéndose hasta con el aire que respiramos y en la otra es el Estado quien posee esas empresas... Cualquier intento de proponer otra cosa es aniquilado, es lo que tiene el autoritarismo. \n\nSe sabe que en España y Ucrania el anarquismo si estaba funcionando pero la propia URSS los aniquiló. Por otro lado, Rusia bajo la URSS pasó de ser super pobre a una super potencia en tiempo record y China es ahora mismo la única que puede hacerle frente a USA y tienen hasta mejores coches a mejor precio,  asi que algo hicieron bien (la cuestión es a qué precio). Los demás paises que están probando el comunismo o alguna forma de el es porque fueron completamente arrasados y han tenido que empezar de cero + las fuertes sanciones que USA lee impone (la famosa \"deuda\"). Ve contra USA y esta ordena que los bancos te congelen el capital y te convierten en apestados con los que nadie puede negociar... Obviamente estos países no pueden competir contra las potencias europeas que llevan siglos enriqueciéndose con el colonialismo. \n\nAsí que la falacia de que solo se puede prosperar bajo el cspitalismo es falsa, a lo largo fe la historia ha habido muchos imperios y sociedades con otros sistemas economicos (checa el \"don\", de Mauss), pero te tienes que salir de la \"historia de occidente\" para conocer estos ejemplos, porque si es por nuestro sistema educativo, hasta hace poco la imagen de la prehistoria que nos enseñaban era la de una familia actual viviendo en condiciones \"salvajes\" sin ningun tipo de prueba científica, solo es una fantasia sacada de nuestro modo de entender el mundo actual, pero las pruebas indican mas bien otra cosa.",
        "id": "mym2hrv",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      }
    ]
  },
  {
    "title": "este subreddit está lleno de gente ardida",
    "comments": [
      {
        "comment": "Saludos, estimado /u/DeliciousBluebird710, y usuarios de r/OpinionesPolemicas.\n\nGracias por aportar nuevos e interesante y/o funables temas a nuestra comunidad, recuerda respetar las reglas para así tener un mejor espacio para que todos sean incluidos. ¿Quieres saber los últimos cambios más importantes del subreddit? [Entra aquí](https://www.reddit.com/r/OpinionesPolemicas/comments/1itpl7v/cambios_importantes_llegan_a_ropinionespolemicas/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) ¿Te interesa lo que pasa en medio oriente? [Entra aquí](https://www.reddit.com/r/OpinionesPolemicas/comments/1letslf/megathread_sobre_el_medio_oriente/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button).\n\nReiteramos que recuerden leer las reglas antes de interactuar y reportar a aquellos que identifiquen que rompan las mismas. ¡Gracias por formar parte de esta comunidad!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OpinionesPolemicas) if you have any questions or concerns.*",
        "id": "mykepk5",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Casi todas las comunidades de reddit, amigo xd",
        "id": "mykfazn",
        "score": 5,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El mundo* al parecer nunca dejará de estar lleno de imbeciles e hipócritas.",
        "id": "mykfeot",
        "score": 5,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si está muy cagado este subreddit zzz",
        "id": "mykk6zm",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Por eso se llaman opiniones polémicas, porque genera polémicas ¿si captas?",
        "id": "mykgl03",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Lo más probable es que si te dicen que tu opinión es estúpida o pendeja, es porque lo sea.\n\nOye, según yo, no le hemos dado ban permanente a nadie. Incluso, casi no lo hacemos y muy pocas veces baneamos gente por más de 5 días. \n\nPor qué dices que baneamos? Genuinamente tengo curiosidad de saber qué piensan los usuarios del sub.",
        "id": "myknqow",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Viendo quien se \"arde\" en un post de Reddit jajajaja (sonó si después de esto te murieras o algo así )",
        "id": "myku0aw",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "¡Todos somos ardidos en alguna cosa! Y pues aquí venimos a liberarnos jajaja.",
        "id": "mykw3qb",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Los mods son zurdos, el nombre del peluca y el trompetas son literalmente triggers Pero el de Nicolás Maduro, Evo Morales (puedo poner sus nombres como si nada) lo dejan normal. Ni puedo poner mi insulto favorito a los de izquierda porque también lo dejaron como trigger. Te invocamos r/Umigol.",
        "id": "myl8dk3",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Hay excepciones a la regla. Yo no aviento un insulto antes de ser atacado primero. Ahí si ni siquiera utilizo groserías ni vulgaridades, solo me burlo exponiendo realidades. \n\nLa técnica del judo y la mayéutica me han servido de mucho!\n\nSaludos",
        "id": "mykhiry",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "es de los mejores para ver a gente que se cree inteligente lpm JAJJDADAH",
        "id": "mykyrgz",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "si pero la gente no deberia arderse y no chingar",
        "id": "mykypx5",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Por eso no debería de haber censura Pero la hay",
        "id": "myl8h3e",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Unas personas que conozco",
        "id": "mykzmbl",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Jajaja pues solo di a conocer mi disgusto pero si se puede ver de ese modo es vd",
        "id": "mykzjo8",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      }
    ]
  },
  {
    "title": "La ONU esta de adorno al igual que el Papa.",
    "comments": [
      {
        "comment": "Saludos, estimado /u/Kitchen-Deer-7953, y usuarios de r/OpinionesPolemicas.\n\nGracias por aportar nuevos e interesante y/o funables temas a nuestra comunidad, recuerda respetar las reglas para así tener un mejor espacio para que todos sean incluidos. ¿Quieres saber los últimos cambios más importantes del subreddit? [Entra aquí](https://www.reddit.com/r/OpinionesPolemicas/comments/1itpl7v/cambios_importantes_llegan_a_ropinionespolemicas/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) ¿Te interesa lo que pasa en medio oriente? [Entra aquí](https://www.reddit.com/r/OpinionesPolemicas/comments/1letslf/megathread_sobre_el_medio_oriente/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button).\n\nReiteramos que recuerden leer las reglas antes de interactuar y reportar a aquellos que identifiquen que rompan las mismas. ¡Gracias por formar parte de esta comunidad!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OpinionesPolemicas) if you have any questions or concerns.*",
        "id": "myjzcf1",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "¿Descubriste también que el agua moja?, la ONU nunca ha servido para nada, no debería ni existir",
        "id": "myk2jx9",
        "score": 9,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Descubriste américa",
        "id": "myk0lz0",
        "score": 8,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Claro que no, el Papa medio entre Chile y Argentina y logro evitar una guerra",
        "id": "myk41ed",
        "score": 6,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "La ONU solo es usada para hacerte creer que se puede hacer algo cuando entidades corruptas están haciendo un mal al mundo con comunicados ,sirve para evadir impuestos de los más ricos que hacen donaciones,tapar casos horribles que cometen países poderosos o suavizarlos y darles un puesto humanitario para llenarles el ego a burgueses privilegiados que jamás le tomarían la mano a una persona pobre Pero tienen su estrellita de salvadores.\nSirven para crear una entidad que predica falsos mensajes de paz y humanidad y así tapar el chingadero que sus amigotes políticos hacen en el mundo es igual que las entidades internacionales.",
        "id": "mykdl5w",
        "score": 4,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Recién me di cuenta que pagas una millonada por pertenecer a la ONU, debemos salir de cuanto antes.",
        "id": "mykgrdt",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "La queja de la Onu la entiendo.\n\nPero que demonios esperas que haga el Papa? Armar una cruzada?",
        "id": "mykjd1y",
        "score": 4,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si, tienes razón. Pero en pleno 2025, ¿Qué esperas que haga el Papa? Ya no estamos en la edad Media donde los estados Pontificios eran realmente gigantes y la Iglesia tenía un ejército poderoso. Tampoco estamos en el Siglo XX donde a la gente realmente le importaba lo que decía el Papa y le hacían caso. \n\nHoy por hoy la opinión del Papa sobre los conflictos del mundo vale un poquito más que la de algún presidente latinoamericano promedio.",
        "id": "myko4y1",
        "score": 4,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El papa, el dalailama, el papa ortodoxo, los testigos de jahve",
        "id": "myk5o38",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Ambos se mueven por 💰",
        "id": "myk6fat",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Ya lo sabia! Básicamente a eso se refieren cuando mencionan la palabra \"Matrix\". \n\nLos gobiernos, las corporaciones, las marcas registradas, las escuelas, industrias multinacionales. Todo eso (y más) es la maldita matrix de la cual deberíamos desconectarnos.\n\nY si tienes razon. Nos controlan, nos dividen, entorpecen la evolución humana y crean caos. \n\nPara ellos somos simples fichas en su morboso juego.\n\nNuestro \"Juego del Calamar\" personal.",
        "id": "myk0fzp",
        "score": 5,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Algo nuevo...",
        "id": "mykdoqk",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No lo que pasa es que su propósito es controlar no evitar guerras y más bien permitir ciertas específicas guerras \n\nSi el día de mañana de Colombia es alzar en armas contra qué sé yo México ahí probablemente intervendría porque no es conflicto que les convenga de hecho ni siquiera llega a pasar al punto de intervención porque desde mucho antes se evita \n\nAh pero cuando es algo que sí les interesa ahí si no hacen un c***** y al contrario hacen lo que es necesario para que ocurra sin exponerse",
        "id": "mykkzri",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Son todos cómplices amigo, ni izquierda ni derecha, son todos lo mismo jugando un rol.",
        "id": "mykri5b",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El Papa es más útil que la ONU, aunque no sea una consigna difícil tampoco",
        "id": "myktvsj",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "¿Qué quieres que haga el Papa? El Papa es solo un cura, no tiene tropas, ni aviones, ni tanques, ni barcos, ni misiles, ni drones, que puede hacer el Papa, más que pedir a los países que dejen de matarse.",
        "id": "myku2sd",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El papa es una figura de mas de 2mil años de tradición y representa a la religión mas grande del mundo. Su influencia esta reducida y esta bien. Tampoco esperes unas cruzadas. \nLa ONU ahi te doy la razon.",
        "id": "mykujas",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "La ONU no está de adorno. Está para que sólo se se pueda hacer algo si va contra los intereses de una potencia.\n\nPero también hay que ser justos. Qué se espera que haga la ONU? Supongamos que mañana se reúne la asamblea general, EEUU no veta, y sale una resolución condenando el ataque de Israel a Iran. Qué sigue? Obligar a Israel parar el ataque?\n\nY también hay que ser honestos. No es como que Iran no se lo haya estado buscando. Hamas, Hezbollah y los hutíes llevan ya tiempo atacando a Israel, y todos sabemos que son financiados por Iran. Y además, eso de estar diciendo todo el tiempo que van a desarrollar una bomba atómica para destruir a Israel tampoco es que sea ni inteligente ni mucho menos un acto se buena fe.\n\nEntonces, tenemos un país, Iran, que lleva tiempo atacando con proxies a Israel, y que lleva tiempo desarrollando un programa nuclear con el objetivo abierto de aniquilarlos. Se ha intentado parar ese programa de muchas formas: mediante diplomacia, mediante hackeos. Pero nada. El ayatolah ha seguido pese a todo. No es que quedaran muchos caminos, la verdad.",
        "id": "myl0plr",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Epaaa, epaa, la diplomacia es fundamental sin ella tendríamos guerras cada que hay un conflicto menor.",
        "id": "myldbry",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Todos se burlan de la ONU, pero nadie está dispuesto a ceder su soberanía para empoderarla, he ahí la hipocresía de los paises que tanto le tiran a la ONU por su inutilidad. \n\n\nLe están pidiendo peras al olmo, y si les llevas un peral tampoco les parece.",
        "id": "myldc6v",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Mentira el Papá por lo menos manda en el vaticano",
        "id": "mylhx0l",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Desde el momento que tiene un Consejo de Seguridad con derecho a veto, ya está. Cierren ese antro.",
        "id": "mym3y05",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "La ONU es una entidad CORRUPTA!\n\n[https://www.reddit.com/r/Konspira\\_Misterio/comments/1l6wyx0/corrupci%C3%B3n\\_en\\_la\\_onu/](https://www.reddit.com/r/Konspira_Misterio/comments/1l6wyx0/corrupci%C3%B3n_en_la_onu/)\n\nPARA MAS DETALLES VISITA:\n\n[https://stopworldcontrol.com/es/dellaonu/](https://stopworldcontrol.com/es/dellaonu/)\n\n\n\nSaludos.-",
        "id": "mykmx5h",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Muy cierto!!!.\n\n[https://www.reddit.com/r/Konspira\\_Misterio/comments/1l6wyx0/corrupci%C3%B3n\\_en\\_la\\_onu/](https://www.reddit.com/r/Konspira_Misterio/comments/1l6wyx0/corrupci%C3%B3n_en_la_onu/)\n\nSaludos.-",
        "id": "mykmftr",
        "score": 0,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Eso fue hace *Googlea... 40 años!!! Desde entonces ese Papá se murió, el siguiente renunció y el siguiente a ese se murió. Era otro mundo ese",
        "id": "mykof4u",
        "score": 0,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "100%\n\n[https://www.reddit.com/r/Konspira\\_Misterio/comments/1l6wyx0/corrupci%C3%B3n\\_en\\_la\\_onu/](https://www.reddit.com/r/Konspira_Misterio/comments/1l6wyx0/corrupci%C3%B3n_en_la_onu/)\n\nSaludos.-",
        "id": "mykmklj",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Muy cierto, La ONU es una entidad CORRUPTA!\n\n[https://www.reddit.com/r/Konspira\\_Misterio/comments/1l6wyx0/corrupci%C3%B3n\\_en\\_la\\_onu/](https://www.reddit.com/r/Konspira_Misterio/comments/1l6wyx0/corrupci%C3%B3n_en_la_onu/)\n\nPARA MAS DETALLES VISITA:\n\n[https://stopworldcontrol.com/es/dellaonu/](https://stopworldcontrol.com/es/dellaonu/)\n\n\n\nSaludos.-",
        "id": "mykn58c",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Uy JAJAJA y el Vaticano no.",
        "id": "myl2qe4",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Gracias me gustan mucho esos posts.",
        "id": "mykncs3",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Genial, gracias por tu aprecio. Saludos.-",
        "id": "mykoete",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      }
    ]
  },
  {
    "title": "En cuestión de Lore, Raddhan nunca fue superior a Malenia",
    "comments": [
      {
        "comment": "Saludos, estimado /u/Spirited_Reception15, y usuarios de r/OpinionesPolemicas.\n\nGracias por aportar nuevos e interesante y/o funables temas a nuestra comunidad, recuerda respetar las reglas para así tener un mejor espacio para que todos sean incluidos. ¿Quieres saber los últimos cambios más importantes del subreddit? [Entra aquí](https://www.reddit.com/r/OpinionesPolemicas/comments/1itpl7v/cambios_importantes_llegan_a_ropinionespolemicas/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) ¿Te interesa lo que pasa en medio oriente? [Entra aquí](https://www.reddit.com/r/OpinionesPolemicas/comments/1letslf/megathread_sobre_el_medio_oriente/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button).\n\nReiteramos que recuerden leer las reglas antes de interactuar y reportar a aquellos que identifiquen que rompan las mismas. ¡Gracias por formar parte de esta comunidad!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OpinionesPolemicas) if you have any questions or concerns.*",
        "id": "mykvxy5",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "r/Eldenring",
        "id": "mykwx3o",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si. Radahn prime es contra el que pelea Malenia en caelid (y empatan al final). Miquella revive a radahn en el cuerpo de mohg, y no hay motivo para que fuera superior al radahn que peleó contra Malenia, no tenía su runa ni tampoco el cuerpo de mohg lo ayuda mucho. En la segunda fase de radahn estamos peleando contra Miquella por lo que radahn sigue relativamente igual en poder por su cuenta. En cambio sabemos que Malenia si se vuelve más fuerte cuando pelea contra nosotros, por lo que Malenia fase dos> radahn en su prime= malenia caelid > consorte radahn",
        "id": "mykyxq3",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "La primera fase del Radahn del DLC no es como se enfrentó a Malenia. Mira el tamaño del Radahn original, es el doble de grande que el del DLC, además que el Radahn original usa ataques que el del DLC no. El Radahn al que se enfrentó Malenia era más grande y fuerte que la primera fase del DLC. Y Malenia solo lo superó porque se rindió a la putrefacción roja, y quedó en coma por ello.",
        "id": "mylbnjl",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Compro la explicación",
        "id": "mykwmbc",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Vi en un video que en su segunda face malenia se convierte en la misma diosa de la putrefacción o fue muy alusin el YouTuber?",
        "id": "mykx02x",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Tengo entendido también que el Radahn del dlc está fusionado con el cuerpo de Mohg , o renació de él por un ritual, o algo así",
        "id": "mykxihi",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "https://youtube.com/@vaatividya?si=g5yf45bx7IXyExL2\n\nDe nada.",
        "id": "myl2mea",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Em, creo que ésto tendría más sentido ponerlo en un sub de videojuegos o un sub de ese juego",
        "id": "myl2dvc",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Todavía no juego ER pero aprecio que uses este espacio lleno de preguntas y opiniones pobremente construidas para hablar de algo realmente importante en comparación.",
        "id": "myl4xo8",
        "score": -2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Esto es",
        "id": "mylg0xu",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      }
    ]
  },
  {
    "title": "El comunismo es la manera más rápida de alcanzar la ruina general",
    "comments": [
      {
        "comment": "Que anarquista? De que tipo? No pudiste dar una aclaración mas burda y mediocre, sabiendo que los 2 tipos de anarquistas son completamente distintos los unos a los otros\n\n\nAnarquista a lo Makno? O anarquista a lo Von mises, danos un contexto mierda, si lo quieres es credibilidad es el minimo carajo",
        "id": "myim9zq",
        "score": 6,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No es una opinión polémica, todos los bots de Twitter la repiten a lo largo y ancho del Internet constantemente. Fuera de eso en mi parecer es algo ignorante medir el impacto del socialismo(el comunismo nunca existió en la realidad) a nivel histórico porque fue aplicado a medias y en países pobres. Pero bueno.",
        "id": "myileml",
        "score": 16,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "¿Por qué un \"anarquista\" habla de economía, moral y de sociedades \"débiles\"? \n\nYa te vi liberalista disfrazado, a mí no me engañas. Bien dicen que el \"anarco-capitalista\" es el más tibio o el más denso de los anarquistas.",
        "id": "myinr7n",
        "score": 4,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Y el capitalismo es la manera de alcanzar la ruina total. Más os valía empezar a criticar y proponer soluciones contra los problemas que está causando el capitalismo, en vez de atacar  fantasmas del comunismo.",
        "id": "myilbce",
        "score": 23,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El colectivo general continúa con la antigua visión del Socialismo/Comunismo ligada a la URSS a más de 35 años de su caída.\n\nAdemás la mayoría no es capaz de distinguir el socialismo del comunismo casi usándolos como sinónimos. La realidad del socialismo hoy en día es muy diferente. Tanto así que la nación que más ha tenido crecimiento en los últimos 40 años de la historia de la humanidad es un país Socialista.",
        "id": "myim0jz",
        "score": 6,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Haití no es comunista y mira como está, Guatemala es un bastión de la derecha católica capitalista ¿Y porque está lleno de pobres y gente que arriesga su vida para emigrar ?",
        "id": "myimcxb",
        "score": 5,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Adivinare, te hacían bullying en la escuela?",
        "id": "myilc23",
        "score": 7,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "![gif](giphy|wMNK4IfeH86uQ)",
        "id": "myilw8i",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Opinion polemica desde cuando?",
        "id": "myiqz4o",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Déjame adivinar, te dejaron un ensayo final y te quedaste picado. Ya llegaste a la parte en que el progreso del capitalismo no se traduce en bienestar o estás estás ahorrando para agua Saratoga?",
        "id": "myisdmv",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Moral que glorifica la debilidad? Orgullo trabajador, unión de los pueblos, revolución, guerra de clases. Es la moral de la URSS en gran medida, que industrializó una Rusia muy atrasada en tiempo récord, le aguantó una guerra de cuatro años a la potencia militar del momento (Alemania), que tomó Berlín, llegó a estar empatada en el primer puesto con los EEUU como superpotencia política y militar. Me gustaría entender mejor a lo que te refieres con eso.\n\nAdemás, cuidado con confundir al socialismo y el comunismo. Por lo que dices, parece que te refieres al socialismo",
        "id": "myitl10",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Déjame adivinar...\n\n20-25 años, sin empleo formal o con uno relativamente mal pagado, universidad promedio no pública (si acaso) y que aún vives con tus padres...",
        "id": "myj3fwp",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "“Soy anarquista..” aww vean al nene, acaba de descubrir sobre las ideologías políticas y acaba de escoger la suya! \n\nMejor chambea bro, o algo, ns",
        "id": "myjao22",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Neta no se cansan de hablar lo mismo del comunismo que nada más conocen por propaganda?",
        "id": "myir2f8",
        "score": 7,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "-Como confirmar en público que no tienes ni idea del comunismo.\nPor si acaso, te hago un resumen:\n\n“Los medios de producción forman parte del estado”\n\nPunto. Si vas a criticar el comunismo (todo es criticable) por lo menos “ataca” en el foco del asunto, no en el humo",
        "id": "myipdr9",
        "score": 5,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "En China les va bien 🤔",
        "id": "myiqyr8",
        "score": 5,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Fuente: un tiktok de 10 segundos.",
        "id": "myj0wwo",
        "score": 4,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "varias preguntas para poder dar una respuesta correcta:\n\n1. no has leido ni el manifiesto, ni el capital, ni nada del estilo verdad?\n\n2. cuando dices que eres anarquista, no te refieres al anarquismo de bakunin verdad?\n\n3. con glorificar la debilidad a que refieres?\n\n4. suponiendo que la respuesta a la pregunta 1 es si, de donde has sacado tu informacion sobre el comunismo?",
        "id": "myixgpu",
        "score": 6,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "\"se suele imponer una moral que glorifica la debilidad\" de donde sacaste eso ? \n\npunto aparte todas las ideologias son utopicas, el mismo liberalismo tiene un horizonte cercano al liberalismo clásico pero nunca sera como se quiere. Porque una cosa es la realidad y la otra la ideología , es decir habra tantos tipos distintos de capitalismo como de comunismo en muchas realidad de sociedades en donde se implemente. Así como hay paises capitalistas sumamente autoritarios como algunos de europa o medio oriente que tienen ese sistema , tambien hay paises capitalistas que son mas \"libres\" como los de escandinavia. Así mismo, pueden haber paises con comunismo que podrían , tal vez, ser mas libres y otros que sean sumamente autoritarios y despotas.",
        "id": "myir6k3",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Sí, y la segunda manera de alcanzarlo es el capitalismo caníbal y rapaz, ve África, la mitad de Asía y la mitad América.",
        "id": "myirgk2",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Mmmh, viendo la historia reciente, la mejor manera de llegar a la ruina es desobedecer a los intereses de estados unidos.  \nNo sos un anarquista, sos un libertarian. El anarquismo propone la comunidad y la cooperacion.",
        "id": "myisjes",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "el wey q leyó el libro negro y nada más:",
        "id": "myj6rue",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Que se siente vivir en el capitalismo vendiendo 8 o más horas de tu tiempo para recibir un salario con el que apenas te alcanza para pagar mes a mes tus obligaciones",
        "id": "myj80mh",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Bruh, todo eso ya pasa en el capitalismo",
        "id": "myj85ay",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No eres anarquista, porque todo anarquista de verdad es comunista, porque el objetivo del comunismo es acabar con el estado y toda estructura de poder.\n\nDeberias de verdad leerte un poco de Adam Smith, padre del capitalismo, y Karl Marx, padre del comunismo. Ambos te explican como surje el capitalismo, que hace que funcione y no funcione, en que clases divide la sociedad y como la organiza económicamente.\n\nTodo lo que has descrito ahí, todo, es ahora mismo el capitalismo. El comunismo no es una utopia, el comunismo es literalmente como los humanos viviamos en la naturaleza.\n\nY ya para adelantarle a todo el que me lea, en el comunismo tienes comercio, tienes empresas, tienes trabajo, tienes salario, algunos cobran mas que otros, puedes abrir un negocio si quieres y no tienes que compartir tu cepillo de dientes con nadie. Lo que NO permite el comunismo es personas con 100 casas, 9 yates, que controlen medio mundo con una empresa como Google o BP y que maten de hambre al resto.\n\nEl capitalismo funcionó para la clase trabajadora mientras el foco de la economía era la clase trabajadora. Hoy en día el foco es mercados inflatorios y especulativos que mueven mas dinero imaginario que material hay en el mundo",
        "id": "myj8g7f",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si fijate en china.",
        "id": "myiq3ye",
        "score": 4,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "el 90% e lo que dijiste fue una descripcion del capitalismo puro, no hay ejemplo mas claro del capitalimo sobre mala distribucion de recursos cuando en el mundo hay miles de personas que mueren de hambre teniendo recursos de sobra para resolver ese problema sin mencionar que es totalmente irracional que 200 personas sean mas ricas que todo el resto de la humanidad junta, el capitalismo si bien tendra sus cosas buenas tambien tiene sus cosas malas y la cultura del consumo esta llevando al mundo a su colapso, la brecha entre ricos y pobres cada dia es mayor y gracias a empresarios hay en el poder cada vez mas facista o locos  y un largo etc........el socialismo tendra sus cosas malas pero prefiero un modelo politico que trate de equilibrar la balanza a uno donde rige el salvese quien pueda",
        "id": "myiyh2b",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "La opinión más normie que he visto en este sub.",
        "id": "myiq9xl",
        "score": 4,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Comunismo es convertir un país en una macroempresa de malpagados aún mas esclavizados a una minoría de avaros que se ríen en secreto de sus partidarios.",
        "id": "myikrxi",
        "score": 5,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "china",
        "id": "myj5q8w",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si por anarquista quieres decir AnCap te la compro, de otro modo no se entiende tu \"crítica\".",
        "id": "myini77",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "¿Y entonces como es que una economía de posguerra como la rusa, que venía de un periodo de opresión zarista y poco desarrollo, pudo llegar a amenazar a la potencia capitalista más poderosa del mundo y mantener su pulso durante medio siglo?",
        "id": "myirrfu",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No es la.ruina. es la igualdad en la pobreza.",
        "id": "myizbll",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El argumento más válido que le veo al comunismo es cuando se critica a la falsa meritocracia capitalista. De todas formas, en el comunismo no existe el progreso porque no se incentiva a la innovación. Como todos deben de ser tratados con igualdad de oportunidades, incluso si eso conlleva el quitarle oportunidades a aquellos que sí las merecen, los mejores se sentirán penalizados por no recibir más, o no mucho más, que el que personas que se esfuerzan menos.\n\nEn cualquier caso, hay algo que en el capitalismo sigue existiendo que jamás existiría en el comunismo: la exitocracia. Sin importar los medios con los que hayas conseguido el éxito, si lo has conseguido, eso será lo único que se reconozca.\n\nEl éxito en un sistema comunista no podría existir.",
        "id": "myjbgm5",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El otro día mi jefe me mostró su Lamborghini nuevo, espectacular, verde botella, lindisimo, trabajamos en una empresa moderna en que cada uno cumple sus metas y fija sus horarios, ósea trabajamos como 10 horas al día. \nEl jefe nos ha dicho que si seguimos trabajando así, el próximo año se va a poder comprar un yate.",
        "id": "myjbzn6",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Para ser anarquista no sabes nada de comunismo, el comunismo es utópico y jamás ha existido porque por definición no tiene estado ni gobierno, no ha habido países comunistas pues mientras exista una estructura burocrática no lo puedes llamar así. Luego metes el socialismo en paralelo o como si fueran lo mismo, lo que pareces criticar son los gobiernos autocratas de corte soviético (y derivados), mismos que no son comunistas, solo tenían un partido comunista cuyo objetivo teórico era eliminar al estado después de lograr la igualdad entre camaradas. La ruina se logra con corrupción y mala administración, Grecia por ejemplo no era \"comunista\" hace 20 años y se derrumbó en muy pocos años, la Vietnam unificado y \"comunista\" prosperó. El problema es confiar en líderes y dejarles todo el poder.",
        "id": "myjgli6",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "![gif](giphy|l3q2XhfQ8oCkm1Ts4|downsized)",
        "id": "myjgwad",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Perfecto. Pero el 99% de la poblacion mundial vive en sistemas NO comunistas.\n\n\nEntonces que mas da?",
        "id": "myjhcst",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No se a que viene esto. China es comunista y es la segunda potencia mundial. Pronto la primera",
        "id": "myjk115",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Esto no es una opinión polémica, es una verdad como un templo.",
        "id": "myjm3vi",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Pues siendo anarcocapitalista como eres igual te deberías tentar la ropa... [y tener cuidado con los osos.](https://en.wikipedia.org/wiki/Grafton,_New_Hampshire#Free_Town_Project)",
        "id": "myjmrcq",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Exacto, como en China. 🤣",
        "id": "myjmvvv",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si, el comunismo es vivir en una cárcel miserable, donde no sos dueño de nada. Parece que se haya fundido la urss, cuba, corea del norte, y el cambio de china no alcanza que vean lo pésimo que es. El capitalismo no es el mejor de los sistemas pero gracias a el pasamos de un 95% de pobreza extrema global a un 15",
        "id": "myjp329",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Ya sólo que no sepas diferenciar socialismo de comunismo deja claro que no sabes de lo que hablas.\n\nEdit: de anarquista a anarquista (suponiendo que es es lo que eres, tal y como dices, y no un ancap, que es lo que pareces), si sueltas lo primero que piensas sin saber de qué hablas, nos haces un flaco favor a los demás. Por favor, mírate al menos un par de vídeos de youtube o algo donde te den un resumen de lo que es, lo que significa y para qué sirve cada cosa. Que tengas un buen día",
        "id": "myjp3zz",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Por que siguen hablando del comunismo como si los gobiernos preferirían eso? Que blds.",
        "id": "myjq3vs",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El sub se llama opiniones polémicas capo, no absoluta verdad.",
        "id": "myjqaml",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Jajaja",
        "id": "myjrrc1",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No hay socialismo exitoso y mucho menos sin polémica, así que claramente no es un modelo a seguir. Realmente tu comentario más allá de acertado no lo veo polémico, es solo una realidad, porque los únicos que quieren el socialismo son los que ya tienen planeado cómo hacerse millonarios con eso",
        "id": "myjsru1",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Claro como en China, el país más poderoso del mundo actualmente!",
        "id": "myjtx2o",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si.\n\nY funciona a nivel global, continental, nación, familiar y hasta individual.\n\nYo siempre he dicho: Si los comunistas profesaran sus ideas a nivel personal, se volverían capitalistas en 1 mes.",
        "id": "myjv12d",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      }
    ]
  },
  {
    "title": "Si eres español y apoyas al gobierno a pesar de todos los escándalos de corrupción, eres parte del problema",
    "comments": [
      {
        "comment": "Saludos, estimado /u/rbopq, y usuarios de r/OpinionesPolemicas.\n\nGracias por aportar nuevos e interesante y/o funables temas a nuestra comunidad, recuerda respetar las reglas para así tener un mejor espacio para que todos sean incluidos. ¿Quieres saber los últimos cambios más importantes del subreddit? [Entra aquí](https://www.reddit.com/r/OpinionesPolemicas/comments/1itpl7v/cambios_importantes_llegan_a_ropinionespolemicas/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button).\n\nReiteramos que recuerden leer las reglas antes de interactuar y reportar a aquellos que identifiquen que rompan las mismas. ¡Gracias por formar parte de esta comunidad!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OpinionesPolemicas) if you have any questions or concerns.*",
        "id": "myfsgal",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Creo que ahí está el primer problema, nadie como tal debería \"apoyar\" al gobierno, deberiamos mantenernos siempre en una postura crítica y observadora, señalando lo que se hace mal y también lo que se hace bien pero nunca como tal apoyándolos.",
        "id": "myfvitm",
        "score": 13,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Yo solo pido coherencia, aunque tenga mis preferencias ideologicas en primer lugar quiero un gobierno que cumpla las reglas minimas de decencia",
        "id": "myfvneo",
        "score": 9,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Pero qué dices, la culpa es obviamente de Franco 😅",
        "id": "myfwvco",
        "score": 7,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Que quieres? Que gobierne la ultrahiperarchirecontramegaturbosideralcósmicaderecha?",
        "id": "myfwg94",
        "score": 7,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El problema es que ningun partido se salva",
        "id": "myfx05l",
        "score": 8,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "no lo apoyo solo voto a PSOE para que no gane VOX",
        "id": "myg104c",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "\"Roba pero menos\" \"Roba pero hace\" cosas que escuchó siendo de argentina sobre Cristina, no parece cambiar con España. Por lo que vi igual, no tienen 1 partido bueno, el Pp y Psoe son lo mismo y Vox se hacen los fachos para conseguir esas bancas en diputados nomas (jamas van a ganar si no se entibiecen), tienen esos votos asegurados.",
        "id": "myg4iz2",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El español que vota la izquierda es masoquista por excelencia (muchos votan a la izquierda no por estar a favor de ella sino por estar en contra de lo que sea medianamente de derecha) hara todo lo posible de que no gobierne algo con atisbo a derecha, se dejará subyugar, llenar de impuestos, ver deteriorirado su calida de vida para que a final d dia salga con el pañito de agua tibia de: al menos no nos gobierna la derecha.\n\nY ojo.... La politica españa la derecha e izquierda dan bastante pena, eso es un circo. Solo que le Español prefiere seguir siendo simpatizante de la izquierda y alejarse a cualquier cosa con atisbo de derecha.",
        "id": "myg8l1k",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Si eres español y votas al pp, vox, psoe o sumar eres parte del problema. Así es mejor.",
        "id": "myfu91l",
        "score": 7,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "…ciudadanos.",
        "id": "myfsmkk",
        "score": 5,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No entiendo qué tiene de opinión polémica este post",
        "id": "myg04t4",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Sánchez debería dimitir e ir a la cárcel",
        "id": "myg443a",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Entonces, según tu lógica, cualquiera que apoye a un gobierno bajo investigación por casos de corrupción forma automáticamente parte del problema. Curioso, porque eso debería aplicarse también a quienes apoyaron gobiernos del PP durante la Gürtel, Bárcenas, Kitchen, Lezo, Púnica o Taula, ¿no?\n\nPorque si vamos a hablar de “nidos de corrupción”, hay partidos que directamente han sido condenados en firme como organización criminal.\n\nLo de mover el listón moral es justo lo que estás haciendo: moral absoluta para unos, moral flexible para otros. Y eso no es ética, es sesgo político disfrazado de indignación.\n\n¿Quieres dimisiones? Perfecto. Pero con la misma vara para todos. Porque si el criterio es “sospecha de corrupción = disolución del gobierno”, aquí no quedaría nadie ni en tu lado ni en el contrario. La política española no necesita puristas selectivos, necesita justicia y responsabilidad real, no linchamientos a medida del color político.",
        "id": "myg6qfo",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Meter en el mismo saco el lawfare con el fiscal general y los bulos sin fundamento de la familia de Sánchez que la corrupción sistémica de los partidos del bipartidismo, sí que es parte del problema.",
        "id": "myga2vn",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Con M.Rajoy media España se hizo la tonta y no sabían reconocer al presidente del país, ahora no hay un P. Sánchez pero no pierdes la oportunidad de sacar tu basura, buen aporte.",
        "id": "mygagma",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Yo pensé que no quedaría nadie a estas alturas pero no está de más entrar a Reddit a ver que sigue habiendo tremendos borregos.\n\nY la corrupción casi es lo de menos, querer cargarse la separación de poderes influyendo en el poder judicial o regalarle dinero de todos al independentismo para comprar su apoyo me parece peor.\n\nPero les da igual todo porque eggggtremadeggechaaaa podríais votar a podemos al menos que no se van de putas con vuestro dinero.",
        "id": "mygiqh3",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "yo no entiendo como se puede ser socialista y no exigir la dimisión de sanchez y elecciones cuanto antes para renovar el partido.",
        "id": "myftmw1",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No, no es así de sencillo. Lo que hay al otro lado está más sucio y además es más peligroso. Al menos todavía no hemos visto ningún Excel con P. Sánchez.",
        "id": "myfxhkn",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Y si no, también.",
        "id": "myfy2nq",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "No es sólo el gobierno. Es la monarquía de partidos, y mientras no cambie el sistema político hacia uno con una mayor separación de poderes y mejores mecanismos de elección, al estilo de lo que proponía Antonio García Trevijano, seguirá habiendo corrupción en España, venga del PP o del PSOE o de los que iban a regenerar cosas.",
        "id": "myg3ano",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "A ver, que es una democracia representativa votamos cada 4años al menos malo, no a vox, y rezamos para que no nos suban los impuestos, donde somos los malos?",
        "id": "mygg00m",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "¿Cuántos argentinos nazis están troleando en este post sobre España?",
        "id": "mygpxhe",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Prefiero que me robe un socialista que un pepepajajajajajajajajajaja no puedo terminar la frase lo siento",
        "id": "mygw2sd",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Lo mismo si sos Norteamericano o argentino",
        "id": "mygwdz9",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Siempre hemos sido parte del problema. Por eso nos llaman \"Rojos Fusilables\".\n\n“No queda más remedio que empezar a fusilar a 26 millones de hijos de puta”, que decía el general patriota.\n\nLos vascos sabían lo que había y no les hicimos caso.",
        "id": "mygzvxv",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Yo perdí toda fé en la política española cuando vi que la única respuesta que la gente sabe aportar a que x es corrupto, sea que y más.\n\nX e Y se intercambian dependiendo de a quién vote el que responde.",
        "id": "myh1les",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "El titular sería; Si eres español y apoyas a \"cualquier\" \\[Presente, pasado y futuro\\] gobierno a pesar de todos los escándalos de corrupción, eres parte del problema.\n\n![gif](giphy|bkLuDE6blqWXk7Ncyv)",
        "id": "myh82nc",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "menos mal que Sanchez ya piensa por nosotros y nos deja votar,no vaya a ser que votemos mal y no salga elegido",
        "id": "myhh35s",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Apoyar al gobierno liderado por los presuntos corruptos del PSOE es una cosa, y otra es querer que gobiernen los incluso más corruptos del PP y VOX, que no están ofreciendo ningún tipo de soluciones excepto el \"quítate tú que me ponga yo\" para establecer el pesebre de empresas de amiguetes amorradas a las instituciones igual que en las autonomías en que gobiernan juntos. A los únicos que he oído con propuestas reales para acabar con los corruptos y corruptores es a Podemos y ERC, pero lamentablemente si hay elecciones no van a tener el poder de ejecutar ningún cambio, entonces por qué vamos a apoyar un cambio de gobierno?",
        "id": "myhwu5s",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Vete a estadísticas de partidos políticos con casos de corrupción, vas a flipar, y además si crees que la solución es la oposición, más todavía",
        "id": "myi856o",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Mira querido ciudadano o como prefieras llamarte, no lo se\n\n>Si eres espanol y apoyas la monarquía a pesar de todos los escandalos de corrupción, eres parte del problema\n\nCómo te suena así? Requiere una gran cantidad de valores aceptar que ambos postulados podrian ser ciertos y tomarse tiempo a evaluar a la luz de los hechos desde la.imparcialidad. Por el titulo del post veo un caso de, *\"estos escandalos de corrupcion si son graves no como los anteriores\"*. Un relato que tratan de vender los medios y dueños de medios cuando un gobierno no les gusta, lo intentan desde el primer dia. Esto es Opiniones Polémicas y yo no soy español, y aun asi se de los escandalos enormes de corrupcion y otras cosas en la monarquia. Asi que dudo que 'ahora' sea cuando la corrupcion llego a la politica dw España. Peor aun, un estafador como Milei acuso a Pedro Snchez y su esposa, esto dice que tipo de personas estan en su contra. \n\nSi dices que la corrupcion del gobierno actual de españa es enorme y sin precedentes debes demostrarlo en realidad, como y en que sentido es mas que en gobiernos anteriores. Pero llegas afirmando algo complejo como simple por lo cual creo debes cambiar de fuentes de información primero. \n\nDe nuevo, esto es opiniones polémicas asi que digo todo esto de modo directo y polemico. Puede ademas que quieras decir que soy zurdo y estoy a favor de la corrupcion o algo similar y no. Lo contrario, creo en disminuir y luchar contra la corrupcion en todos los paises. Por tanto es importante poder saber cuando hay menos o mas corrupcion. Y poder **demostrarlo**.",
        "id": "myii572",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Hay que cambiar de estructura, todo probar cosas nuevas ¿Quién esta dispuesta a escuchar y ser escuchado y dejar de apoyar su partido al estilo trival? PPSOE, todos podridos.",
        "id": "myiw7r8",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Lo verdaderamente preocupante NO es la corrupción por la pasta. Eso es \"casi\" natural, se persigue, se condena y resuelto.  \nLo peligroso es el mensaje de \"bueno, un poco pero solo esos tres\"... y hay que hacer piña porque que la gente vote a otro(s) partidos y nos quite de aquí sería un desastre para la nación.  \nAsí empiezan los iluminados, no puede ser que YO no tenga razón, os equivocáis en no votarme... así que mejor ya ni votáis, total... es por vuestro bien.",
        "id": "myiwimz",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "La gente de españa representa un 9% de la gente que habla español en el mundo, que haces comentando en este sub?",
        "id": "mykdu31",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Yo voto al PSOE siempre desde el extranjero. Me habéis echado de España y os merecéis eso y más.",
        "id": "mykgkzi",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Vale en vez de votar a un partido orrupto votemos a otro partido corrupto que asi se arregla españa",
        "id": "mylcujy",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Y la solucion es un golpe de estado a punta de pistola con militares y tomar el pais por 40 años fusilando y poniendo a la gente en fosas, esta ya me la se.\n Votemos a ver que pasa, que esto es una democracia.",
        "id": "mylhren",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Por favor límpiate la cara que la tienes llena.",
        "id": "myls7lw",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "A mi lo que me hace gracia es lo de \" es que los otros son peores \"\nCómo si el Psoe no fuera el partido más corrupto de calle. Solo con los ere ya robaron más que el PP en toda su historia.\nLas buenas posturas no hay que mentir para defenderlas.",
        "id": "mylz6k6",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Ilumíname, a quien deberíamos apoyar ? A los nazis de Vox o a los más corruptos de todos del PP ?",
        "id": "myfx6ud",
        "score": -2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "mas haya de la corrupción, el problema reside en la cantidad de medidas anti mercado que toman. la única razón por la que aun no experimentan la pobreza que sus políticas crean es que son parte de la Unión Europea...",
        "id": "mygbemk",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Los nazis están contentos con tu post",
        "id": "myfunc2",
        "score": -24,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Sí, para que voten a Vox y tengamos fascismo 2.0 .  La gente está lerda, les dan a escoger con qué soga los van a ahorcar y todavía maman diciendo \"es lo menos malo que hay\", \"los impuestos son necesarios\", \"los bancos brindan un servicio insustituible al país\". Como que no hay cabeza para figurarse que hay detrás de todo esquema político.\n\nSi a algún partido le importara un bledo el pueblo, hablarían de eso, se opondrían a la especulación, avisarían al pueblo embobado. Pero no sólo esto sino que el gentío se deja explotar como la mugre: saben que los bancos están al acecho para que no puedas pagar la deuda y asi quedarse con lo pagado y con el aval, y aun asi siguen comiendo de su mano. Saben que la inmobiliaria vive de subir los precios, prácticamente volviendo esclavo al albañil y al comprados, y aun asi la gente les compra. Protestarían contra el impuesto sobre la propiedad y contra el trabajador autónomo para así al menos poder sobrevivir fuera del mercado laboral, pero saben que la clase alta se hace rica haciendo a los currelas producir mas a cambio del mínimo exigido y que si pudieran los tendrían como a los subcontratados a una miseria por 12 horas al dia viviendo en chabolas... pero les da igual. Y la gente come mierda diciendo que les dignifica. Pero los vagos chupópteros saben mejor cómo mantener al ganado bajo control mejor de lo que el ganado se quiere creer.\n\nLa gente dice furiosa: \"El gobierno tiene que hacer así\" y una promesa tras otra nos torean peor que al novillo de turno. Ni el novillo de turno lleva tantas banderillas clavadas como la muchedumbre española. Toda clase la alta sabe. Por eso están donde están y cobran en vez de pagar.",
        "id": "myfy13i",
        "score": -6,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Es precisamente lo que abogo. Independientemente de las ideas políticas de cada uno, si los partidos políticos interpretan que tienen un voto ideológico cautivo, van a seguir ocurriendo casos de corrupción. \n\nEl razonamiento es: si estos gilipollas me van a seguir apoyando, porque a pesar de todo, los de enfrente les dan más miedo, puedo hacer lo que me plazca.",
        "id": "myfw7v7",
        "score": 6,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "La oposición la forma un partido condenado por financiación ilegal y otro investigado por sus préstamos y manejo de dinero.",
        "id": "myfxzq8",
        "score": 3,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Pues ni PP, ni PSOE ni VOX las cumplen donde han gobernado. El votante tiene memoria frágil y grandes tragaderas.",
        "id": "myfw956",
        "score": 9,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "100% esto.",
        "id": "myg3yio",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "¿Me dices un caso de corrupción de Podemos? Uno.",
        "id": "mygal2i",
        "score": 2,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      },
      {
        "comment": "Hay más partidos.",
        "id": "mygb2dk",
        "score": 1,
        "clasificacion_zero_shot": "Sí",
        "clasificacion_few_shot": "Sí",
        "clasificacion_chain_of_thought": "Sí"
      }
    ]
  }
]