[
  {
    "flair": "Discussion",
    "title": "What's a trend in movies right now that you wish dies a horrible death?",
    "author": "Prabu-Silitwangi",
    "date": "2025-04-28T05:57:49",
    "score": 10318,
    "description": "For me it's the uninspiring use of popular songs from the 70s, 80s, 90s, but preferably nirvana. It has to be nirvana if possible. Take the hook, slow it down and drown it in a heavy reverb effects and you just created a masterpiece of cinematical background music because the young audience will think the song is cool and the older ones will like it because it's nostalgic.",
    "comments": [
      {
        "user": "Any-Difficulty-1247",
        "comment": "please god, have them hire some lighting people and start shooting back on real places and not just in front of green screens",
        "score": 16324,
        "date": "2025-04-28T06:14:05"
      },
      {
        "user": "AporiaParadox",
        "comment": "Overinflated budgets that lead to movies needing to make an absurd amount of money just to break even. Indiana Jones and the Dial of Destiny did not need to cost 300 million dollars, especially since it doesn't even look that good, where the hell did all that money go? Was it the 10 minutes of CGI rejuvenated Harrison Ford?",
        "score": 5321,
        "date": "2025-04-28T06:15:47"
      },
      {
        "user": "TonyMontana546",
        "comment": "The terrible sound mixing",
        "score": 4028,
        "date": "2025-04-28T06:16:37"
      },
      {
        "user": "holman",
        "comment": "Shit is too dark. Let me watch the thing I paid to watch. I can’t see it.",
        "score": 5893,
        "date": "2025-04-28T06:01:27"
      },
      {
        "user": "Snake_Plissken224",
        "comment": "I wish they would bring back bloopers during the credits in comedies",
        "score": 4625,
        "date": "2025-04-28T07:02:35"
      },
      {
        "user": "Compass_Needle",
        "comment": "The sound levels being weird so that you have to turn up the volume for the speaking, but then get blasted by sound-effects 2 seconds later.\n\nHaving to watch a film with the remote control in my hand so I can constantly change the volume is bloody annoying.",
        "score": 3791,
        "date": "2025-04-28T07:18:29"
      },
      {
        "user": "Warm_Shoulder3606",
        "comment": "Making every antagonist redeemable. What ever happened to a good ole piece of shit villain?",
        "score": 3286,
        "date": "2025-04-28T07:00:07"
      },
      {
        "user": "InFocuus",
        "comment": "Live remakes of animated classics.",
        "score": 4159,
        "date": "2025-04-28T06:12:56"
      },
      {
        "user": "BlackSpinedPlinketto",
        "comment": "Action sequence then ‘funny quip’. If something scary happens, the audience should be allowed to feel it, or what’s the point? It makes everything worthless and unrealistic.\n\nAnd also predictable. Not every film needs to be Guardians of the Galaxy.",
        "score": 1075,
        "date": "2025-04-28T09:19:04"
      },
      {
        "user": "xXCh4r0nXx",
        "comment": "Remakes of movies that were perfectly fine.\nOverusing jump scares in horror movies.\nMaking everything CG",
        "score": 239,
        "date": "2025-04-28T07:37:21"
      },
      {
        "user": "ranch_brotendo",
        "comment": "This isn't as major an issue to me as the question suggests but a minor thing is I kinda wish that movies were less polished than they are now as it feels sterile sometimes. There's a slickness to a lot of movies now where it feels like there's a lack of warmth compared to like 70s 80s 90s to 2000s where they felt more like actors talking slightly awkwardly sometimes or being clumsy or improvising more obviously. Idk",
        "score": 108,
        "date": "2025-04-28T08:58:05"
      },
      {
        "user": "fleekonpoint",
        "comment": "Trailer starts now",
        "score": 1539,
        "date": "2025-04-28T06:05:51"
      },
      {
        "user": "Postsnobills",
        "comment": "The theatrical run of anything is so brief that you can’t make time for it, or you’d rather just not bother and wait for streaming.\n\nSure, it doesn’t help that ticket prices and concessions are egregious. Nor does it help that everyone has forgotten how to behave in a communal space…\n\nBut maybe we could crawl back to the before times if the institution of the movie theater mattered more for viewership.",
        "score": 960,
        "date": "2025-04-28T06:04:37"
      },
      {
        "user": "IndependenceMean8774",
        "comment": "Rapid cutting. You can hold a shot for more than a few seconds, you know.\n\nAlso, with rare exceptions, the Dutch angle needs to be consigned to the wastebin of film history.",
        "score": 485,
        "date": "2025-04-28T07:11:20"
      },
      {
        "user": "BuckarooBonsly",
        "comment": "I have a couple.  \n\nI miss standalone Blockbusters. Not everything needs to have a shared, complex universe. And not everything needs to be part of a huge franchises.  \n\nI miss traditional animation. Like, the old hand drawn 2D animation. Even the stuff done with computers but in the style of hand-drawn animation. Most of the animated movies now just lack character.",
        "score": 667,
        "date": "2025-04-28T11:49:08"
      },
      {
        "user": "deepinthemosh",
        "comment": "Diluting all the colours to make it feel more gritty. Let films look like film",
        "score": 974,
        "date": "2025-04-28T06:10:28"
      },
      {
        "user": "Plz_PM_Steam_Keys",
        "comment": "Everyone looks so fake. I use to not notice people were wearing makeup but now I notice it and everyone looks too perfect.",
        "score": 499,
        "date": "2025-04-28T08:22:28"
      },
      {
        "user": "Yommination",
        "comment": "Quippy humor in everything",
        "score": 1380,
        "date": "2025-04-28T06:40:05"
      },
      {
        "user": "BonerChamp11",
        "comment": "Fuckin Multiverses.",
        "score": 1141,
        "date": "2025-04-28T06:22:13"
      },
      {
        "user": "Lemonsweets25",
        "comment": "Terrible costuming in most period dramas compared to just 20 years ago. I don’t necessarily blame the costume team as I’m sure most of them are very skilled but I think they’re forced to make a lot of costumes with limited time and money. Also the HD filming imo doesn’t work for period dramas and makes the costumes look even worse",
        "score": 154,
        "date": "2025-04-28T08:50:06"
      },
      {
        "user": "T_raltixx",
        "comment": "Trailers showing too much. \n\nPoor sound mixing so I can't hear what is being said.\n\nNot everything has to be a franchise.",
        "score": 203,
        "date": "2025-04-28T06:43:18"
      },
      {
        "user": "anonymous",
        "comment": "[deleted]",
        "score": 1142,
        "date": "2025-04-28T06:05:18"
      },
      {
        "user": "SignificantIsland187",
        "comment": "I wish we would stop obsessing over character’s trauma and back story to explain everything about them and let them make some interesting decisions that happen purely within the context of the immediate plot.",
        "score": 653,
        "date": "2025-04-28T06:04:05"
      },
      {
        "user": "rageinthecage666",
        "comment": "Dialog volume being low while music,action or sex scenes are way too loud, cannot watch a modern movie without the remote ready",
        "score": 306,
        "date": "2025-04-28T06:50:30"
      },
      {
        "user": "smokeyfantastico",
        "comment": "When it's established IP outside of film, they shoehorn in a random normal person transported to that IP universe so the movie can exposition dump.",
        "score": 291,
        "date": "2025-04-28T06:13:35"
      },
      {
        "user": "presterkhan",
        "comment": "I need to hear the dialogue, this is very important.",
        "score": 67,
        "date": "2025-04-28T10:08:16"
      },
      {
        "user": "HuaHuzi6666",
        "comment": "Remakes & franchising. Like sure it’s fun to see a good movie rebooted well/there are good sequels, but so many are just obvious cash grabs.",
        "score": 619,
        "date": "2025-04-28T06:00:31"
      },
      {
        "user": "debtRiot",
        "comment": "Slowed down choir versions of 90s songs in trailers. It was cool the first time. It’s just lazy now.",
        "score": 635,
        "date": "2025-04-28T06:18:45"
      },
      {
        "user": "lamaldo78",
        "comment": "Flashbacks and time jumping in general. I get that sometimes it's an effective story telling method but I don't need every goddamn movie, TV show hell even adverts do it, to involve a flashback. Especially movies that begin with a shot from the end then the entire movie is basically a flashback up until that point.",
        "score": 54,
        "date": "2025-04-28T08:18:07"
      },
      {
        "user": "PopCultureWeekly",
        "comment": "Trailers that give away the entire plot",
        "score": 94,
        "date": "2025-04-28T06:50:57"
      },
      {
        "user": "IwonderifWUT",
        "comment": "Clicky guns! Guns don't (or aren't supposed to) make noise when moved, and they certainly don't click with multiple trigger pulls when empty. It's my biggest pet peeve with action movies and immediately destroys immersion.",
        "score": 48,
        "date": "2025-04-28T06:52:55"
      },
      {
        "user": "lukoreta",
        "comment": "Toning everything down to PG-13 for maximum profit\n\nAnd no, I don't necessarily want everything to be dark, edgy, and R-rated either. Just make the movie as best as it can be and as close to the pitch as possible and then rate it accordingly, especially if it's a IP known to have dark and edgy moments.",
        "score": 163,
        "date": "2025-04-28T07:01:17"
      },
      {
        "user": "reasonableblubird15",
        "comment": "Everything is a joke. Any time tension is built, or a heavy moment takes place, it's immediately undercut by some lame joke that kills the point of the scene. \n\nIf everything is funny, then nothing is.",
        "score": 163,
        "date": "2025-04-28T07:26:33"
      },
      {
        "user": "Southernbeekeeper",
        "comment": "I don't know what the word to describe it is but the constant exposition. It's like every time the scene changes the conversation in the next scene has to recap what just happened. The use of \"news footage\" to do this is also awful. The super hero movies are really bad for this. The recent captain america movie honestly feels like it was written by AI.",
        "score": 331,
        "date": "2025-04-28T06:58:28"
      },
      {
        "user": "MarzipanCheap3685",
        "comment": "barely audible dialogue + ear splittingly loud action and/or music. especially if the actors are mumbling",
        "score": 122,
        "date": "2025-04-28T06:41:12"
      },
      {
        "user": "CharSmar",
        "comment": "Trailers being way too long and basically showing the entire movie in condensed form.",
        "score": 664,
        "date": "2025-04-28T06:27:52"
      },
      {
        "user": "TheVyper3377",
        "comment": "Fight scenes that use shaky cam and excessive jump-cuts. That trend needs to be loaded into a canon and fired into the sun (in one long, steady take).",
        "score": 402,
        "date": "2025-04-28T06:00:43"
      },
      {
        "user": "kuuups",
        "comment": "Making remakes of timeless movies. Just fucking create new ones from new stories ffs.",
        "score": 271,
        "date": "2025-04-28T06:03:18"
      },
      {
        "user": "WalkingCarpet",
        "comment": "Trying to make a character confident and assertive but they just come off like a smug asshole.",
        "score": 96,
        "date": "2025-04-28T06:35:08"
      },
      {
        "user": "babybird87",
        "comment": "The need to bloat an 1 and 45 minute movie to 2 hours 15 minutes..",
        "score": 98,
        "date": "2025-04-28T10:12:45"
      },
      {
        "user": "TappyMauvendaise",
        "comment": "Meta anything",
        "score": 118,
        "date": "2025-04-28T06:12:12"
      },
      {
        "user": "Jordonzo",
        "comment": "Cgi is fine, but can we bring back some practical effects ? Imagine alien came out this year, half the movie would just be cgi wouldn't be the same movie at all.",
        "score": 34,
        "date": "2025-04-28T11:47:41"
      },
      {
        "user": "automaticzero",
        "comment": "I don’t mind using music from the 60’s, 70’s, ect. But what i do mind is the way they turn the originals into cringey “reimagined” monstrosities for the trailers. “How can we turn ‘Good Vibrations’ into something dark and sinister?” Just stop. ",
        "score": 113,
        "date": "2025-04-28T06:41:24"
      },
      {
        "user": "Anakin_Dripwalker501",
        "comment": "Recasting the same 10 damn actors in every role. Like where’s the hiring and audition process?",
        "score": 358,
        "date": "2025-04-28T06:11:37"
      },
      {
        "user": "Etzell",
        "comment": "I call those \"Bummer Remixes\", thanks to [Team America.](https://www.youtube.com/watch?v=RNYGRf6Nw0k)\n\n\nBut too much damn teal and orange",
        "score": 135,
        "date": "2025-04-28T05:59:23"
      },
      {
        "user": "homecinemad",
        "comment": "Climactic CGI-drenched incoherent battle scenes with little to no emotional stakes.\n\n\nGeneric Zimmer-lite music.\n\n\nConstant hunger for expanded universes (read: greed).",
        "score": 79,
        "date": "2025-04-28T06:36:10"
      },
      {
        "user": "shotsallover",
        "comment": "Rubber superheroes.\n\nCompletely indestructible superheroes are boring. There has to be something that hurts you. You can't just tank a punch from the most powerful being in the galaxy, go flying across the planet, land, dust yourself off, and say, \"That's all you got?\" Get hurt dammit. Retreat and figure out another way. No one is totally invincible with an infinite pain threshold.\n\n*Black Adam* was the worst example of this. Everyone's so overpowered that none of the hits matter. No one takes any damage. No one is truly hurt. Even the human characters are indestructible. That was one thing the first phase of the MCU got (mostly) right. People get injured and it takes them a while to recover. Stuff goes wrong. And so on. By the end it was a little ridiculous, and Phase 2 has been dreadful in that regard *cough* Eternals *cough*. People can't connect to characters that have no real weaknesses other than the thin spots in their plot armor.",
        "score": 44,
        "date": "2025-04-28T06:56:01"
      },
      {
        "user": "Multiplexion",
        "comment": "Using “Fortunate Son” literally every time the Vietnam war comes up as a subject.\n\nDoesn’t matter what film, I haven’t seen a single Western-made movie on the subject that doesn’t use it at least once.\n\nMy fucking god we get it. Stop using that damn song.",
        "score": 153,
        "date": "2025-04-28T06:19:17"
      },
      {
        "user": "DunnoMouse",
        "comment": "Please for the love of God, stop setting fight scenes to upbeat pop music, it's been old ever since Deadpool did it too",
        "score": 177,
        "date": "2025-04-28T06:19:22"
      },
      {
        "user": "McFlyyouBojo",
        "comment": "I just want to see movie shoot more on location again. The Criterion Channel has a curated set of movies from the \"fun city\" era of movies right now. Basically \"fun city\" was a time period in the late 60s-early 70s where NYC gave incentives to shoot in the city, and a lot of foreign directors and no name directors along with established directors found success. These movies utilized a lot of issues for the time like race relations, urban decay, etc... but they also treated the city as it's own character, and watching them really gives you the feeling that the city is moving and breathing. I particularly love the way that era visually looks and I honestly wish to see that type of film or whatever come back.",
        "score": 19,
        "date": "2025-04-28T11:30:44"
      }
    ]
  },
  {
    "flair": "AMA",
    "title": "Hey man, we're Cheech and Chong, we’re doing one of those Ask Us Anything things. You can ask about our lives, careers, or new movie (Cheech and Chong's Last Movie) and we’ll do our best to remember things. Bring a bud and a snack or two, just no math questions please.",
    "author": "CheechandChong-AMA",
    "date": "2025-04-24T12:56:18",
    "score": 5701,
    "description": "Hey man, we're Cheech and Chong, we’re doing one of those Ask Us Anything things. You can ask about our lives, careers, or new movie (Cheech and Chong's Last Movie) and we’ll do our best to remember things. Bring a bud and a snack or two, just no math questions please. \n\nWe'll be back at 4 PM ET today to answer your quesitons.\n\nMore info about our new movie:\n\nOfficial Trailer:\n\n[https://www.youtube.com/watch?v=yFZaR4ubS20](https://www.youtube.com/watch?v=yFZaR4ubS20)\n\nCHEECH & CHONG’S LAST MOVIE – Exclusively in Theaters Friday 4/25 🥦\n\nIn the 1970s, Cheech & Chong redefined stand-up comedy, blending drugs, sex, rock’n’roll, and improvisation into a genre-shaping act. Their multicultural, irreverent humor turned them into icons, counterculture rock stars, and Hollywood legends. How did Cheech and Chong ignite imaginations and stay relevant over 50 years? Join them for one last ride to find out... and bring a bud!\n\nDirected by: David Bushell\n\nProduced by: David Bushell and Robbi Chong\n\nStarrirg: Cheech Marin and Tommy Chong",
    "comments": [
      {
        "user": "BunyipPouch",
        "comment": "This AMA has been verified by the mods. Cheech and Chong will be back at 4 PM ET today to answer your questions.\n\nMore information:\n\n--------------------------------------------------------------------------------\n\nHey man, we're Cheech and Chong, we’re doing one of those Ask Us Anything things. You can ask about our lives, careers, or new movie (Cheech and Chong's Last Movie) and we’ll do our best to remember things. Bring a bud and a snack or two, just no math questions please. \n\nWe'll be back at 4 PM ET today to answer your quesitons.\n\nMore info about our new movie:\n\nOfficial Trailer:\n\nhttps://www.youtube.com/watch?v=yFZaR4ubS20\n\nCHEECH & CHONG’S LAST MOVIE – Exclusively in Theaters Friday 4/25 🥦\n\nIn the 1970s, Cheech & Chong redefined stand-up comedy, blending drugs, sex, rock’n’roll, and improvisation into a genre-shaping act. Their multicultural, irreverent humor turned them into icons, counterculture rock stars, and Hollywood legends. How did Cheech and Chong ignite imaginations and stay relevant over 50 years? Join them for one last ride to find out... and bring a bud!\n\nDirected by: David Bushell\n\nProduced by: David Bushell and Robbi Chong\n\nStarrirg: Cheech Marin and Tommy Chong",
        "score": 1,
        "date": "2025-04-24T12:58:21"
      },
      {
        "user": "CanadianCannababe",
        "comment": "What does your current relationship with weed actually look like? Are you, as many assume, high all day every day? Or do you smoke once at the end of each day? Perhaps only one or two times a week? How much do you consume on an average day/week/month/etc? I’m hoping for actual numbers here, for visualization purposes and so I can fully comprehend the answer.",
        "score": 168,
        "date": "2025-04-24T14:13:32"
      },
      {
        "user": "kpt_graubrot",
        "comment": "Probably not one of your most remembered projects but I have a soft spot for YELLOWBEARD. How was working on the movie with that stacked cast? \n\nAlso heard Peter Sellers was a fan of yours and once greeted you with a brick of hash, is that true?",
        "score": 64,
        "date": "2025-04-24T13:44:23"
      },
      {
        "user": "palabear",
        "comment": "Do people still confuse you for Dolly Parton & Burt Reynolds?",
        "score": 67,
        "date": "2025-04-24T14:15:13"
      },
      {
        "user": "almightywhacko",
        "comment": "This one is for Cheech:\n\nThis goes back a way, but what was it like working with the Golden Girls cast? Plus a young Don Cheadle! \n\nThe Golden Palace was short lived, but it was a great show with a strong cast and great premise. I wish you had all been given a little bit longer to entertain us all!",
        "score": 59,
        "date": "2025-04-24T14:47:48"
      },
      {
        "user": "TheTelephone",
        "comment": "Huge fan of your old stuff! I'm a teacher now, and at least once a year have students listen to Basketball Jones and Sister Mary Elephant.\n\nObviously the landscape of comedy has changed a lot since since the 1970s; how do you feel about the current 2025 stage of comedy, not just in contrast to the 70s but in contrast to even the recent past, 2010's and 2020's?",
        "score": 138,
        "date": "2025-04-24T13:41:23"
      },
      {
        "user": "roadbeef",
        "comment": "I've got so many questions!\n\n- Tolerance breaks!  How do you two fellas cycle that in?\n\n- Mustaches! Worth the effort and maintenance?\n\n- What aspect of filmmaking has been the most fun for you?  Was it a portion of work preparing a film, or a portion making?  And did you have fun with your final film??\n\nThank you kindly for your lifetimes of entertainment and chillaxitude!!  Legends",
        "score": 94,
        "date": "2025-04-24T14:02:36"
      },
      {
        "user": "FratBoyGene",
        "comment": "Just curious - what do you think of the weed today vs. the weed you had when you were making your first movies?",
        "score": 114,
        "date": "2025-04-24T13:05:54"
      },
      {
        "user": "Imaginesium",
        "comment": "What do each of you consider to be the most enjoyable project you've ever worked on together? \n\nAnd which, in hindsight, was the worst/most difficult?",
        "score": 40,
        "date": "2025-04-24T13:41:12"
      },
      {
        "user": "PeteRows",
        "comment": "Hello, grew up watching Up In Smoke and Born In East LA. Just wanted to know:\n1. What was your favorite/funnest movie to work on, on or off the set?\n\n2. What were your comedic influences growing up that caused you to go in this direction?\n\n3.  How do you both feel about the change in the culture of marijuana since you started this run?",
        "score": 38,
        "date": "2025-04-24T14:36:47"
      },
      {
        "user": "ap1msch",
        "comment": "How much of your persona has been you, how much was weed, and how much was putting on a mask that people expected you to wear? (metaphorically)",
        "score": 36,
        "date": "2025-04-24T13:21:49"
      },
      {
        "user": "Vergenbuurg",
        "comment": "Tommy, I was just wondering if you could put into words seeing the children you've raised become stars in their own right, and having appeared in such iconic films as *Commando* and *The Matrix*. \n\n\nI imagine you're proud, but I'd love to read your own take on that.",
        "score": 33,
        "date": "2025-04-24T14:38:45"
      },
      {
        "user": "majorjoe23",
        "comment": "How's Dave?",
        "score": 20,
        "date": "2025-04-24T14:09:21"
      },
      {
        "user": "ITeechYoKidsArt",
        "comment": "I gotta figure you guys have met some pretty weird dudes over the years. Who was the weirdest dude you guys ever met and what made him special? Thanks man!",
        "score": 19,
        "date": "2025-04-24T13:29:15"
      },
      {
        "user": "codykonior",
        "comment": "I loved all of your movies growing up and owned the cassette tapes too! They were so much fun, thanks. \n\nMy question: In the 90s you suddenly stopped making movies together and the gossip was that you two had a falling out, and then you seem to have reconciled a decade or more later.\n\nIf it’s true and not too painful, what was the falling out over?",
        "score": 35,
        "date": "2025-04-24T13:50:54"
      },
      {
        "user": "AbbeyRoad75",
        "comment": "Did Dave ever get into his friends house?",
        "score": 18,
        "date": "2025-04-24T13:11:28"
      },
      {
        "user": "Inside-Canary-7327",
        "comment": "Hey Chong! Which castmate from that 70s show did you get along with the best?",
        "score": 53,
        "date": "2025-04-24T13:03:35"
      },
      {
        "user": "night_in_the_ruts",
        "comment": "Cheech - my dad met you briefly on a golf course in Puerto Vallarta; you were hanging out & passing out beer to people.\n\n  \nWas that something you did a lot? Are you a golfer?",
        "score": 17,
        "date": "2025-04-24T13:56:21"
      },
      {
        "user": "zedkhov13",
        "comment": "Hey guys,\n\nI was the lead designer on your game Cheech and Chong, Bud Farm. I was the one that mentioned that I met Gaye Delorme in a pub below the skytrain station in New Westminster. He mentioned that he knew you two while attempting to pay for his house wine with his fake eyeball after he signed my sketchbook (unprompted, lol) \"Gaye Fuckball Delorme\" he also got into a heated arguement with a Nigerian guy named Newman. It was amazing.\n\nAntways, I just wanted to say how much of a pleasure it was working on a project for you two. I still have the signed Chong framed image from the game and tickets to your show from Victoria hanging on my wall.\n\nOne of my career highlights, for sure. Looking forward to the movie!\n\nCheers",
        "score": 61,
        "date": "2025-04-24T13:56:47"
      },
      {
        "user": "Aspiring-Old-Guy",
        "comment": "Hey Cheech, you still crushing fools in Jeopardy? That was so cool to hear about that",
        "score": 15,
        "date": "2025-04-24T14:03:01"
      },
      {
        "user": "TBMachine",
        "comment": "What is Cheech's mustache up to these days? I miss him. Thanks for the laughs, gentlemen.",
        "score": 14,
        "date": "2025-04-24T13:36:52"
      },
      {
        "user": "nwod_mlac",
        "comment": "Towards the end of \"UnAmerican Bandstand\"...when you are introducing Blind Melon Chitlin....you rattle off some intro words that sound like: \n\nHe is the man wither his south\n\nHappy Happy Blackie Nappy\n\nPInk too fried the bitch\n\nWhat exactly are you saying? This has been driving me nuts for over 40 years, man.\n\n\n\nIt's right here, man: [https://youtu.be/yUOnDTO0auk?t=263](https://youtu.be/yUOnDTO0auk?t=263)",
        "score": 14,
        "date": "2025-04-24T15:22:22"
      },
      {
        "user": "Blue_Streak_Diamond",
        "comment": "Hey cheech, do you still remember the pussy speech from dusk till dawn by heart?",
        "score": 37,
        "date": "2025-04-24T13:00:06"
      },
      {
        "user": "VolatSea",
        "comment": "Your performances in After Hours really adds an interesting depth to the film, what was it like working with Scorsese?",
        "score": 25,
        "date": "2025-04-24T13:24:29"
      },
      {
        "user": "Hellwagon",
        "comment": "The first time I saw you guys I was seven years old and my dad and his buddy took me and my nine year old brother to the drive in for a Cheech and Chong double feature.  There was a playground at the bottom of the screen and we sat there and looked at all the smoke pouring out of the car windows as the movie played and had no idea what in the hell was going on.\n\nI just know up until that point I never heard my old man laugh that hard.  My dad’s name is Dave, and at 76 he still answers the phone and says Dave’s not here man.  Love you guys for that, it kills me every time.",
        "score": 25,
        "date": "2025-04-24T14:10:00"
      },
      {
        "user": "Qwirk",
        "comment": "I don't have anything to ask. Just hope you both are doing well, seeing you both pop up in movies over the years brings a smile to my face. \n\nI feel like there is still another story out there, C&C get tired of their kid's/grand kids bullshit and tell them to stay off your lawn... or something.",
        "score": 10,
        "date": "2025-04-24T14:33:03"
      },
      {
        "user": "noshowthrow",
        "comment": "When you were in a strait jacket and you needed someone to scratch your balls... was that something you wrote or did you come up with that on the day?\n\nI'm in my 50's and my brother and I STILL quote that to each other constantly! \n\nLove you guys!",
        "score": 36,
        "date": "2025-04-24T13:00:08"
      },
      {
        "user": "dormango",
        "comment": "I hear you knocking but you can’t come in!",
        "score": 9,
        "date": "2025-04-24T13:44:18"
      },
      {
        "user": "hyborians",
        "comment": "Did you ever meet Bob Marley?",
        "score": 16,
        "date": "2025-04-24T14:03:14"
      },
      {
        "user": "MooseMalloy",
        "comment": "Why wasn't it Chong and Cheech?",
        "score": 23,
        "date": "2025-04-24T14:19:30"
      },
      {
        "user": "ohsureshould-should",
        "comment": "What’s your favourite memory of each other that makes you laugh?",
        "score": 15,
        "date": "2025-04-24T13:35:21"
      },
      {
        "user": "adzee_cycle",
        "comment": "Do you chaps prefer sativa or indica?",
        "score": 11,
        "date": "2025-04-24T13:16:18"
      },
      {
        "user": "YourJailDad",
        "comment": "Hey Chong do you remember smoking one with me at the Highwood festival in 1993? Haha probably not, but I will never forget. Still have the roach 😊 Thank you for all you both have done.",
        "score": 13,
        "date": "2025-04-24T13:22:50"
      },
      {
        "user": "TepesX",
        "comment": "I just want to say hello and keep being real! You guys are an inspiration to so many generations. Keep on blazing my dudes.",
        "score": 13,
        "date": "2025-04-24T13:38:45"
      },
      {
        "user": "TrumpDumper",
        "comment": "Hey Men,\nI love your movies and probably watched them way too young. \n\nMany of your characters portrayed marijuana smokers as the typical stoners. How do you think your roles perpetuated the stereotype in society and do you think it delayed the legalization of marijuana in the United States? \n\nThanks for doing this.",
        "score": 12,
        "date": "2025-04-24T14:13:23"
      },
      {
        "user": "Muthafuckaaaaa",
        "comment": "How is the vato with the bony knees and no choose on their feet doing these days? \n\nLove you guys btw!",
        "score": 6,
        "date": "2025-04-24T13:42:23"
      },
      {
        "user": "killlballl",
        "comment": "Cannot thank you enough for sharing your creativity and sense of humor with us. \n\nWas sitting in an aisle seat of a theater watching “Up In Smoke” and quite literally fell out into the aisle on my hands and knees laughing during the car hot-box scene. Had to crawl out of the theater, regroup and start again. \n\nNever laughed harder at a movie in a theater. Thanks!\n\nAlso: the bass player sketch from one of your albums. So many years and dead brain cells later, thinking about the word “eggamuffin” still makes me laugh. \n\nGrateful the both of you are still alive and thriving!",
        "score": 6,
        "date": "2025-04-24T14:26:22"
      },
      {
        "user": "goettel",
        "comment": "What are some of your favorite munchies foods? Any weird ones?",
        "score": 10,
        "date": "2025-04-24T13:27:54"
      },
      {
        "user": "Professional-Door161",
        "comment": "Word from the inside send their regards. \nBorn in east LA part 2?",
        "score": 6,
        "date": "2025-04-24T14:12:34"
      },
      {
        "user": "King0fMist",
        "comment": "Could you please explain the ending to the movie Inception?",
        "score": 7,
        "date": "2025-04-24T13:37:00"
      },
      {
        "user": "Shiroiken",
        "comment": "No questions, just wanted to say thanks for all the laughs.  It's good shit man!",
        "score": 3,
        "date": "2025-04-24T13:46:34"
      },
      {
        "user": "muxman",
        "comment": "Out of all of your movies, which one is your favorite?\n\nWhich one had the best final product that you think turned out the best?\n\nAnd which one was the most fun to make? Even if the end product wasn't your favorite.",
        "score": 3,
        "date": "2025-04-24T14:35:46"
      },
      {
        "user": "HotdoghammerOG",
        "comment": "The Cheech museum in Riverside is one of the most raw and uniquely curated art museums I’ve been to. How does your involvement with The Cheech impact what you bring to the big screen? You clearly have an eye for unique art and stories.",
        "score": 5,
        "date": "2025-04-24T15:04:34"
      },
      {
        "user": "magicspooner",
        "comment": "Why wasn’t this AMA on 4/20 lol?",
        "score": 10,
        "date": "2025-04-24T13:55:14"
      },
      {
        "user": "arose321",
        "comment": "I gotta say, you guys are the best. Thank you for being a huge part of my life.",
        "score": 3,
        "date": "2025-04-24T13:26:05"
      },
      {
        "user": "GunnieGraves",
        "comment": "I just want to know if he ever cozied up to that Finklestein boy.",
        "score": 3,
        "date": "2025-04-24T13:35:16"
      },
      {
        "user": "EightBitEstep",
        "comment": "I’m looking for Dave.",
        "score": 3,
        "date": "2025-04-24T13:46:57"
      },
      {
        "user": "rockatthebeach",
        "comment": "Favorite car?",
        "score": 3,
        "date": "2025-04-24T13:48:44"
      },
      {
        "user": "TacoStuffingClub",
        "comment": "Followed these guys and know most the answers to questions I’d have. Except one. What was up with The Shrimp on the Barbie being played relentlessly on Showtime in the 90’s? I swear my high school years this was on more than any other movie. 🤣",
        "score": 3,
        "date": "2025-04-24T13:51:47"
      },
      {
        "user": "Fatal_Syntax_Error",
        "comment": "“Keep on knockin, but you can't come in!”",
        "score": 3,
        "date": "2025-04-24T13:54:45"
      }
    ]
  }
]